dannyf00/Ghetto-GPSDO/v0.6c/dspic33duino.c
#include "dspic33duino.h"						//dspic33duino

//mcus supported
//dspic33fj128GP804, dspic33fj128GP802, dspic33fj128GP204, dspic33fj128GP202
//dspic33fj64GP804,  dspic33fj64GP802,  dspic33fj64GP204,  dspic33fj64GP202
//dspic33fj32GP304,  dspic33fj32GP302


//************XC********************
#if defined(__XC16__)
//config words settings
#if 	defined(__dsPIC33FJ128GP804__) | defined (__dsPIC33FJ128GP802__) | defined(__dsPIC33FJ128GP204__) | defined (__dsPIC33FJ128GP202__) | \
		defined(__dsPIC33FJ64GP804__)  | defined (__dsPIC33FJ64GP802__)  | defined(__dsPIC33FJ64GP204__)  | defined (__dsPIC33FJ64GP202__)

//dspic33fj64gp202/204/802/804, dspic33fj128gp202/204/802/804
#pragma config FNOSC = FRC			//FRC, FRCPLL, PRI, PRIPLL, SOSC, LPRC, FRCDIV16, LPRCDIVN
#pragma config POSCMD = XT			//EC, XT, HS, NONE
#pragma config BWRP = WRPROTECT_OFF
#pragma config BSS =  NO_BOOT_CODE
#pragma config RBS =  NO_BOOT_RAM
#pragma config SWRP = WRPROTECT_OFF
#pragma config SSS =  NO_SEC_CODE
#pragma config RSS =  NO_SEC_RAM
#pragma config GWRP = OFF
#pragma config IESO = OFF
#pragma config OSCIOFNC=OFF			//ON: OSC2 as digital IO, OFF: OSC2 has digital output
#pragma config IOL1WAY =OFF			//off: allow multiple reconfiguration, on: allow only one re-configuration
#pragma config FCKSM =  CSECMD		//CSECME, CSECMD, CSDCMD
#pragma config WDTPOST =PS32768
#pragma config WDTPRE = PR128		//PR32, PR128
#pragma config WINDIS = OFF			//off: watchdog timer in non-window mode
#pragma config FWDTEN = OFF
#pragma config FPWRT =  PWR128
#pragma config ALTI2C = OFF
#pragma config ICS =    PGD1		//PGD1, PGD2, PGD3
#pragma config JTAGEN = OFF


/*configuration bits
Boot Segment Write Protect
BWRP = WRPROTECT_ON	Boot segment is write-protected
BWRP = WRPROTECT_OFF	Boot Segment may be written

Boot Segment Program Flash Code Protection
BSS = LARGE_FLASH_HIGH	High Security, Large-sized Boot Flash
BSS = HIGH_LARGE_BOOT_CODE	High Security, Large-sized Boot Flash
BSS = MEDIUM_FLASH_HIGH	High Security, Medium-sized Boot Flash
BSS = HIGH_MEDIUM_BOOT_CODE	High Security, Medium-sized Boot Flash
BSS = SMALL_FLASH_HIGH	High Security, Small-sized Boot Flash
BSS = HIGH_SMALL_BOOT_CODE	High Security, Small-sized Boot Flash
BSS = LARGE_FLASH_STD	Standard Security, Large-sized Boot Flash
BSS = STRD_LARGE_BOOT_CODE	Standard Security, Large-sized Boot Flash
BSS = MEDIUM_FLASH_STD	Standard Security, Medium-sized Boot Flash
BSS = STRD_MEDIUM_BOOT_CODE	Standard Security, Medium-sized Boot Flash
BSS = SMALL_FLASH_STD	Standard Security, Small-sized Boot Flash
BSS = STRD_SMALL_BOOT_CODE	Standard Security, Small-sized Boot Flash
BSS = NO_FLASH	No Boot program Flash segment
BSS = NO_BOOT_CODE	No Boot program Flash segment

Boot Segment RAM Protection
RBS = LARGE_RAM	Large-sized Boot RAM
RBS = LARGE_BOOT_RAM	Large-sized Boot RAM
RBS = MEDIUM_RAM	Medium-sized Boot RAM
RBS = MEDIUM_BOOT_RAM	Medium-sized Boot RAM
RBS = SMALL_RAM	Small-sized Boot RAM
RBS = SMALL_BOOT_RAM	Small-sized Boot RAM
RBS = NO_RAM	No Boot RAM
RBS = NO_BOOT_RAM	No Boot RAM

Secure Segment Program Write Protect
SWRP = WRPROTECT_ON	Secure segment is write-protected
SWRP = WRPROTECT_OFF	Secure segment may be written

Secure Segment Program Flash Code Protection
SSS = LARGE_FLASH_HIGH	High Security, Large-sized Secure Flash
SSS = HIGH_LARGE_SEC_CODE	High Security, Large-sized Secure Flash
SSS = MEDIUM_FLASH_HIGH	High Security, Medium-sized Secure Flash
SSS = HIGH_MEDIUM_SEC_CODE	High Security, Medium-sized Secure Flash
SSS = SMALL_FLASH_HIGH	High Security, Small-sized Secure Flash
SSS = HIGH_SMALL_SEC_CODE	High Security, Small-sized Secure Flash
SSS = LARGE_FLASH_STD	Standard Security, Large-sized Secure Flash
SSS = STRD_LARGE_SEC_CODE	Standard Security, Large-sized Secure Flash
SSS = MEDIUM_FLASH_STD	Standard Security, Medium-sized Secure Flash
SSS = STRD_MEDIUM_SEC_CODE	Standard Security, Medium-sized Secure Flash
SSS = SMALL_FLASH_STD	Standard Security, Small-sized Secure Flash
SSS = STRD_SMALL_SEC_CODE	Standard Security, Small-sized Secure Flash
SSS = NO_FLASH	No Secure Segment
SSS = NO_SEC_CODE	No Secure Segment

Secure Segment Data RAM Protection
RSS = LARGE_RAM	Large-sized Secure RAM
RSS = LARGE_SEC_RAM	Large-sized Secure RAM
RSS = MEDIUM_RAM	Medium-sized Secure RAM
RSS = MEDIUM_SEC_RAM	Medium-sized Secure RAM
RSS = SMALL_RAM	Small-sized Secure RAM
RSS = SMALL_SEC_RAM	Small-sized Secure RAM
RSS = NO_RAM	No Secure RAM
RSS = NO_SEC_RAM	No Secure RAM

General Code Segment Write Protect
GWRP = ON	User program memory is write-protected
GWRP = OFF	User program memory is not write-protected

General Segment Code Protection
GSS = HIGH	High Security Code Protection is Enabled
GSS = ON	Standard Security Code Protection is Enabled
GSS = OFF	User program memory is not code-protected

Oscillator Mode
FNOSC = FRC	Internal Fast RC (FRC)
FNOSC = FRCPLL	Internal Fast RC (FRC) w/ PLL
FNOSC = PRI	Primary Oscillator (XT, HS, EC)
FNOSC = PRIPLL	Primary Oscillator (XT, HS, EC) w/ PLL
FNOSC = SOSC	Secondary Oscillator (SOSC)
FNOSC = LPRC	Low Power RC Oscillator (LPRC)
FNOSC = FRCDIV16	Internal Fast RC (FRC) divide by 16
FNOSC = LPRCDIVN	Internal Fast RC (FRC) with divide by N

Internal External Switch Over Mode
IESO = OFF	Start-up device with user-selected oscillator source
IESO = ON	Start-up device with FRC, then automatically switch to user-selected oscillator source when ready

Primary Oscillator Source
POSCMD = EC	EC Oscillator Mode
POSCMD = XT	XT Oscillator Mode
POSCMD = HS	HS Oscillator Mode
POSCMD = NONE	Primary Oscillator Disabled

OSC2 Pin Function
OSCIOFNC = ON	OSC2 pin has digital I/O function
OSCIOFNC = OFF	OSC2 pin has clock out function

Peripheral Pin Select Configuration
IOL1WAY = OFF	Allow Multiple Re-configurations
IOL1WAY = ON	Allow Only One Re-configuration

Clock Switching and Monitor
FCKSM = CSECME	Both Clock Switching and Fail-Safe Clock Monitor are enabled
FCKSM = CSECMD	Clock switching is enabled, Fail-Safe Clock Monitor is disabled
FCKSM = CSDCMD	Both Clock Switching and Fail-Safe Clock Monitor are disabled

