dannyf00/Ghetto-GPSDO/v0.6c/dspic33duino.c
#elif defined(__C30__)
//config words settings
#if 	defined(__dsPIC33FJ128GP804__) | defined (__dsPIC33FJ128GP802__) | defined(__dsPIC33FJ128GP204__) | defined (__dsPIC33FJ128GP202__) | \
		defined(__dsPIC33FJ64GP804__)  | defined (__dsPIC33FJ64GP802__)  | defined(__dsPIC33FJ64GP204__)  | defined (__dsPIC33FJ64GP202__)

_FBS(
//**   Boot Segment Data Ram:
//**     RBS_LARGE_RAM        Large Sized Boot Ram
//**     RBS_MEDIUM_RAM       Medium Sized Boot Ram
//**     RBS_SMALL_RAM        Small Sized Boot Ram
    RBS_NO_RAM &		//No Boot Ram
//**
//**   Boot Segment Program Memory:
//**     BSS__IGH_LARGE_BOOT_CODE High Security Lar Boot Flash
//**     BSS_LARGE_FLASH__IGH  High Security Lar Boot Flash
//**     BSS__IGH_MEDIUM_BOOT_CODE High Security Med Boot Flash
//**     BSS_MEDIUM_FLASH__IGH High Security Med Boot Flash
//**     BSS__IGH_SMALL_BOOT_CODE High Security Small Boot Flash
//**     BSS_SMALL_FLASH__IGH  High Security Small Boot Flash
//**     BSS_LARGE_FLASH_STD   Standard Security Lar Boot Flash
//**     BSS_STRD_LARGE_BOOT_CODE Standard Security Lar Boot Flash
//**     BSS_MEDIUM_FLASH_STD  Standard Security Med Boot Flash
//**     BSS_STRD_MEDIUM_BOOT_CODE Standard Security Med Boot Flash
//**     BSS_SMALL_FLASH_STD  Standard Security Small Boot Flash
//**     BSS_STRD_SMALL_BOOT_CODEStandard Security Small Boot Flash
    BSS_NO_BOOT_CODE &	//No Boot Segment Program Memory
//**     BSS_NO_FLASH         No Boot Segment Program Memory
//**
//**    Write Protect :
//**     BWRP_WRPROTECT_ON     Enabled
    BWRP_WRPROTECT_OFF    //Disabled
)

_FSS(
//**   Secure Segment Data Ram:
//**     RSS_LARGE_RAM         Large Sized Secure Ram
//**     RSS_MEDIUM_RAM        Medium Sized Secure Ram
//**     RSS_SMALL_RAM         Small Sized Secure Ram
    RSS_NO_RAM &		//No Secure Ram
//**
//**   Secure Segment Program Memory:
//**     SSS_LARGE_FLASH__IGH  High Security Lar Secure Flash
//**     SSS_MEDIUM_FLASH__IGH High Security Med Secure Flash
//**     SSS_SMALL_FLASH__IGH  High Security Small Secure Flash
//**     SSS_LARGE_FLASH_STD   Standard Security Large Secure Flash
//**     SSS_MEDIUM_FLASH_STD  Standard Security Med Secure Flash
//**     SSS_SMALL_FLASH_STD  Standard Security Small Secure Flash
    SSS_NO_FLASH &		//No Secure Segment
//**
//**    Write Protect :
//**     SWRP_WRPROTECT_ON     Enabled
    SWRP_WRPROTECT_OFF    //Disabled
)

_FGS(
//**   Code Protect:
//**     GSS__IGH              high security protect on
//**     GSS_STD               standard security code protect on
    GSS_OFF &			//code protect off
//**
//**   Code Protect:
//**     GCP_ON               Enabled
    GCP_OFF &			//Disabled
//**
//**   Write Protect:
//**     GWRP_ON              Enabled
    GWRP_OFF             //Disabled
)

_FOSCSEL(
//**   Oscillator Source Selection:
		 FNOSC_FRC &          //Fast RC oscillator
//**     FNOSC_FRCPLL         Fast RC oscillator w/ divide and PLL
//    FNOSC_PRI &			//Primary oscillator (XT, HS, EC)
//**     FNOSC_PRIPLL         Primary oscillator (XT, HS, EC) w/ PLL
//**     FNOSC_SOSC           Secondary oscillator
//**     FNOSC_LPRC           Low power RC oscillator
//**     FNOSC_FRCDIV16       Fast RC oscillator w/ divide by 16
//**     FNOSC_LPRCDIVN        Low power Fast RC oscillator w/divide by N
//**
//**   Two-speed Oscillator Startup :
		IESO_OFF             //Disabled
//**     IESO_ON              Enabled
)

_FOSC(
//**   Clock switching and clock monitor:
//**     FCKSM_CSECME         Both enabled
     FCKSM_CSECMD &        //Only clock switching enabled
//    FCKSM_CSDCMD &		//Both disabled
//**
//**   Single configuration for remappable I/O:
    IOL1WAY_OFF &		//Disabled
//**     IOL1WAY_ON           Enabled
//**
//**   OSC2 Pin function:
//**     OSCIOFNC_ON          Digital I/O
    OSCIOFNC_OFF &		//OSC2 is clock O/P
//**
//**   Oscillator Selection:
//**     POSCMD_EC            External clock
     POSCMD_XT           //XT oscillator
//    POSCMD_HS            //HS oscillator
//**     POSCMD_NONE          Primary disabled
)

_FWDT(
//**   Watchdog Timer:
    FWDTEN_OFF &		//Disabled
//**     FWDTEN_ON            Enabled
//**
//**   Windowed WDT:
//**     WINDIS_ON            Enabled
    WINDIS_OFF &		//Disabled
//**
//**   Watchdog prescaler:
//**     WDTPRE_PR32          1:32
    WDTPRE_PR128 &		//1:128
//**
//**   Watchdog postscaler:
    WDTPOST_PS1          //1:1
//**     WDTPOST_PS2          1:2
//**     WDTPOST_PS4          1:4
//**     WDTPOST_PS8          1:8
//**     WDTPOST_PS16         1:16
//**     WDTPOST_PS32         1:32
//**     WDTPOST_PS64         1:64
//**     WDTPOST_PS128        1:128
//**     WDTPOST_PS256        1:256
//**     WDTPOST_PS512        1:512
//**     WDTPOST_PS1024       1:1,024
//**     WDTPOST_PS2048       1:2,048
//**     WDTPOST_PS4096       1:4,096
//**     WDTPOST_PS8192       1:8,192
//**     WDTPOST_PS16384      1:16,384
//**     WDTPOST_PS32768      1:32,768
)

_FPOR(
//**   Alternate I2C pins:
//**     ALTI2C_ON            I2C mapped to ASDA1/ASCL1
    ALTI2C_OFF &		//I2C mapped to SDA1/SCL1
//**
//**   Power-on Reset Value:
    FPWRT_PWR1           //Disabled
//**     FPWRT_PWR2           2ms
//**     FPWRT_PWR4           4ms
//**     FPWRT_PWR8           8ms
//**     FPWRT_PWR16          16ms
//**     FPWRT_PWR32          32ms
//**     FPWRT_PWR64          64ms
//**     FPWRT_PWR128         128ms
)

_FICD(
//**   JTAG Enable Bit:
    JTAGEN_OFF &		//JTAG is disabled
//**     JTAGEN_ON            JTAG is enabled
//**
//**   ICD communication channel select bits:
//**     ICS_NONE             Reserved
//**     ICS_PGD3              communicate on PGC3/EMUC3 and PGD3/EMUD3
//**     ICS_PGD2             communicate on PGC2/EMUC2 and PGD2/EMUD2
    ICS_PGD1             //communicate on PGC1/EMUC1 and PGD1/EMUD1
)

//user ids?
//_FUID0( 0xffff )
//_FUID1( 0xffff )
//_FUID2( 0xffff )
//_FUID3( 0xffff )

