dannyf00/Ghetto-GPSDO/v0.6c/dspic33duino.c
/* -------------------------------------------------------- */
/* Macros for setting device configuration registers        */
/* -------------------------------------------------------- */

/* Register FBS (0xf80000)                               */

//extern __attribute__((space(prog))) int _FBS;
//#define _FBS(x) __attribute__((section("__FBS.sec"),space(prog))) int _FBS = (x);

/*
** Only one invocation of FBS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBS.
** Multiple options may be combined, as shown:
**
** _FBS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Data Ram:
**     RBS_LARGE_RAM        Large Sized Boot Ram
**     RBS_MEDIUM_RAM       Medium Sized Boot Ram
**     RBS_SMALL_RAM        Small Sized Boot Ram
**     RBS_NO_RAM           No Boot Ram
**
**   Boot Segment Program Memory:
**     BSS__IGH_LARGE_BOOT_CODE High Security Lar Boot Flash
**     BSS_LARGE_FLASH__IGH  High Security Lar Boot Flash
**     BSS__IGH_MEDIUM_BOOT_CODE High Security Med Boot Flash
**     BSS_MEDIUM_FLASH__IGH High Security Med Boot Flash
**     BSS__IGH_SMALL_BOOT_CODE High Security Small Boot Flash
**     BSS_SMALL_FLASH__IGH  High Security Small Boot Flash
**     BSS_LARGE_FLASH_STD   Standard Security Lar Boot Flash
**     BSS_STRD_LARGE_BOOT_CODE Standard Security Lar Boot Flash
**     BSS_MEDIUM_FLASH_STD  Standard Security Med Boot Flash
**     BSS_STRD_MEDIUM_BOOT_CODE Standard Security Med Boot Flash
**     BSS_SMALL_FLASH_STD  Standard Security Small Boot Flash
**     BSS_STRD_SMALL_BOOT_CODEStandard Security Small Boot Flash
**     BSS_NO_BOOT_CODE     No Boot Segment Program Memory
**     BSS_NO_FLASH         No Boot Segment Program Memory
**
**    Write Protect :
**     BWRP_WRPROTECT_ON     Enabled
**     BWRP_WRPROTECT_OFF    Disabled
**
*/
/*
#define RBS_LARGE_RAM        0xFF3F
#define RBS_MEDIUM_RAM       0xFF7F
#define RBS_SMALL_RAM        0xFFBF
#define RBS_NO_RAM           0xFFFF

#define BSS__IGH_LARGE_BOOT_CODE 0xFFF1
#define BSS_LARGE_FLASH__IGH 0xFFF1
#define BSS__IGH_MEDIUM_BOOT_CODE 0xFFF3
#define BSS_MEDIUM_FLASH__IGH 0xFFF3
#define BSS__IGH_SMALL_BOOT_CODE 0xFFF5
#define BSS_SMALL_FLASH__IGH 0xFFF5
#define BSS_LARGE_FLASH_STD  0xFFF9
#define BSS_STRD_LARGE_BOOT_CODE 0xFFF9
#define BSS_MEDIUM_FLASH_STD 0xFFFB
#define BSS_STRD_MEDIUM_BOOT_CODE 0xFFFB
#define BSS_SMALL_FLASH_STD  0xFFFD
#define BSS_STRD_SMALL_BOOT_CODE 0xFFFD
#define BSS_NO_BOOT_CODE     0xFFFF
#define BSS_NO_FLASH         0xFFFF

#define BWRP_WRPROTECT_ON    0xFFFE
#define BWRP_WRPROTECT_OFF   0xFFFF
*/
/* Register FSS (0xf80002)                               */

//extern __attribute__((space(prog))) int _FSS;
//#define _FSS(x) __attribute__((section("__FSS.sec"),space(prog))) int _FSS = (x);

/*
** Only one invocation of FSS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSS.
** Multiple options may be combined, as shown:
**
** _FSS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Secure Segment Data Ram:
**     RSS_LARGE_RAM         Large Sized Secure Ram
**     RSS_MEDIUM_RAM        Medium Sized Secure Ram
**     RSS_SMALL_RAM         Small Sized Secure Ram
**     RSS_NO_RAM           No Secure Ram
**
**   Secure Segment Program Memory:
**     SSS_LARGE_FLASH__IGH  High Security Lar Secure Flash
**     SSS_MEDIUM_FLASH__IGH High Security Med Secure Flash
**     SSS_SMALL_FLASH__IGH  High Security Small Secure Flash
**     SSS_LARGE_FLASH_STD   Standard Security Large Secure Flash
**     SSS_MEDIUM_FLASH_STD  Standard Security Med Secure Flash
**     SSS_SMALL_FLASH_STD  Standard Security Small Secure Flash
**     SSS_NO_FLASH         No Secure Segment
**
**    Write Protect :
**     SWRP_WRPROTECT_ON     Enabled
**     SWRP_WRPROTECT_OFF    Disabled
**
*/
/*
#define RSS_LARGE_RAM        0xFF3F
#define RSS_MEDIUM_RAM       0xFF7F
#define RSS_SMALL_RAM        0xFFBF
#define RSS_NO_RAM           0xFFFF

#define SSS_LARGE_FLASH__IGH 0xFFF1
#define SSS_MEDIUM_FLASH__IGH 0xFFF3
#define SSS_SMALL_FLASH__IGH 0xFFF5
#define SSS_LARGE_FLASH_STD  0xFFF9
#define SSS_MEDIUM_FLASH_STD 0xFFFB
#define SSS_SMALL_FLASH_STD  0xFFFD
#define SSS_NO_FLASH         0xFFFF

#define SWRP_WRPROTECT_ON    0xFFFE
#define SWRP_WRPROTECT_OFF   0xFFFF
*/
/* Register FGS (0xf80004)                               */

//extern __attribute__((space(prog))) int _FGS;
//#define _FGS(x) __attribute__((section("__FGS.sec"),space(prog))) int _FGS = (x);

/*
** Only one invocation of FGS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FGS.
** Multiple options may be combined, as shown:
**
** _FGS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Code Protect:
**     GSS__IGH              high security protect on
**     GSS_STD               standard security code protect on
**     GSS_OFF              code protect off
**
**   Code Protect:
**     GCP_ON               Enabled
**     GCP_OFF              Disabled
**
**   Write Protect:
**     GWRP_ON              Enabled
**     GWRP_OFF             Disabled
**
*/
/*
#define GSS__IGH             0xFFFB
#define GSS_STD              0xFFFD
#define GSS_OFF              0xFFFF

#define GCP_ON               0xFFFD
#define GCP_OFF              0xFFFF

#define GWRP_ON              0xFFFE
#define GWRP_OFF             0xFFFF
*/
/* Register FOSCSEL (0xf80006)                               */

//extern __attribute__((space(prog))) int _FOSCSEL;
//#define _FOSCSEL(x) __attribute__((section("__FOSCSEL.sec"),space(prog))) int _FOSCSEL = (x);

/*
** Only one invocation of FOSCSEL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSCSEL.
** Multiple options may be combined, as shown:
**
** _FOSCSEL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Oscillator Source Selection:
**     FNOSC_FRC            Fast RC oscillator
**     FNOSC_FRCPLL         Fast RC oscillator w/ divide and PLL
**     FNOSC_PRI            Primary oscillator (XT, HS, EC)
**     FNOSC_PRIPLL         Primary oscillator (XT, HS, EC) w/ PLL
**     FNOSC_SOSC           Secondary oscillator
**     FNOSC_LPRC           Low power RC oscillator
**     FNOSC_FRCDIV16       Fast RC oscillator w/ divide by 16
**     FNOSC_LPRCDIVN        Low power Fast RC oscillator w/divide by N
**
**   Two-speed Oscillator Startup :
**     IESO_OFF             Disabled
**     IESO_ON              Enabled
**
*/
/*
#define FNOSC_FRC            0xFFF8
#define FNOSC_FRCPLL         0xFFF9
#define FNOSC_PRI            0xFFFA
#define FNOSC_PRIPLL         0xFFFB
#define FNOSC_SOSC           0xFFFC
#define FNOSC_LPRC           0xFFFD
#define FNOSC_FRCDIV16       0xFFFE
#define FNOSC_LPRCDIVN       0xFFFF

