dannyf00/Ghetto-GPSDO/v0.6c/dspic33duino.c
};

//set up pll multipliers
//Fout=Fin / N1 * M / N2
//N1: 0 (2:1), 1 (3:1), ..., 31 (33:1)
//M : 0 (2x ), 1 (3x ), ..., 511 (513x)
//N2: 0 (2:1), 1 (4:1), 2 (6:1), 3 (8:1). DS says 2 is reserved/not use
void pllSet(uint32_t N1, uint32_t M, uint32_t N2) {
	CLKDIVbits.PLLPRE = N1 & 0x1f;
	CLKDIVbits.PLLPOST= N2 & 0x03;
	PLLFBD = M & 0x1ff;
   	//while (OSCCONbits.LOCK == 0) continue;			//1->pll in lock, 0->pll not locked
}

//read pll multiplier
//Fout=Fin / N1 * M / N2
uint32_t pllGet(uint32_t Fin) {
	uint32_t M, N1, N2;

	N1 = CLKDIVbits.PLLPRE + 2;						//valid values: 0(/2)..7(/128)
	M  = PLLFBD + 2;								//valid values: 0(2x)..511(513x)
	N2 = 2 * (CLKDIVbits.PLLPOST + 1);				//valid values: 0(/2), 1(/4), 3(/8). 2(/6) is reserved - don't use
	return Fin / N1 * M / N2;
}


//set up core timer
//global variables
uint32_t SystemCoreClock=F_FRC;			//system core clock, before devided by 2. Updated by SystemCoreClockUpdate()

//for time base off TIMER1 @ 1:1 prescaler
//volatile uint32_t timer1_millis = 0;
volatile uint32_t systick_ovf = 0;
//static uint16_t timer1_fract = 0;
//111 = Fast RC Oscillator with Postscaler (FRCDIV)
//110 = Reserved
//101 = Low-Power RC Oscillator (LPRC)
//100 = Secondary Oscillator (SOSC)
//011 = Primary Oscillator with PLL module (XTPLL, HSPLL, ECPLL)
//010 = Primary Oscillator (XT, HS, EC)
//001 = Fast RC Oscillator with Postscaler and PLL module (FRCPLL)
//000 = Fast RC Oscillator (FRC)
//Needs to be executed during mcu initialization or after oscillator reconfiguration
//updates SystemCoreClock.
uint32_t SystemCoreClockUpdate(void) {
	uint32_t tmp=F_FRC;

	//test for current oscillator configuration
	switch (OSCCONbits.COSC) {
	case 0b111:						//FRCDIVN
		tmp = (F_FRC >> CLKDIVbits.FRCDIV); break;
	case 0b110:						//FRCDIV16
		tmp = F_FRC / 16;				   break;
	case 0b101:						//LPRC
		tmp = F_LPRC;						break;
	case 0b100:						//SOSC
		tmp = F_SOSC;						break;
	case 0b011:						//POSCxPLL
		tmp = pllGet(F_XTAL);				break;
	case 0b010:						//POSC
		tmp = F_XTAL;						break;
	case 0b001:						//FRCxPLL, driven by FRCDIV
		tmp = pllGet(F_FRC >> CLKDIVbits.FRCDIV); 	break;
	case 0b000:						//FRC
		tmp = F_FRC;						break;
	}
	return SystemCoreClock=tmp;
}

//switch oscillator
//return SystemCoreClock in frequency
//111 = Fast RC Oscillator with Postscaler (FRCDIV)
//110 = Reserved
//101 = Low-Power RC Oscillator (LPRC)
//100 = Secondary Oscillator (SOSC)
//011 = Primary Oscillator with PLL module (XTPLL, HSPLL, ECPLL)
//010 = Primary Oscillator (XT, HS, EC)
//001 = Fast RC Oscillator with Postscaler and PLL module (FRCPLL)
//000 = Fast RC Oscillator (FRC)
//Needs to be executed during mcu initialization or after oscillator reconfiguration
//updates SystemCoreClock.
uint32_t SystemCoreClockSwitch(uint8_t nosc) {
	//uint32_t tmp=F_FRC;

	//switch oscillator
	nosc = nosc & 0b111;						//only lowest 3 bits effective
	di();										//disable the interrupt
	do {
		__builtin_write_OSCCONH(nosc);
		__builtin_write_OSCCONL(OSCCON | 0x01);		//set oswen bit -> start the switch
		while (OSCCONbits.OSWEN != 0) continue;		//0->clock switch complete
	} while (OSCCONbits.COSC != nosc);			//make sure that the clock switch is successful. otherwise, hang here
	ei();										//enable the interrupt
	return SystemCoreClockUpdate();				//update the core clock
}

//timer1 overflow isr
//void _ISR_PSV _T2Interrupt(void) {
//	IFS0bits.T2IF=0;							//clear tmr1 interrupt flag
//	systick_ovf+=0x10000ul;							//increment overflow count: 16-bit timer
//}
void tmrInit(TIM_TypeDef *TIMx, uint8_t ps);

//reset the mcu
void mcuInit(void) {
	volatile uint32_t i=100000ul; while (i--) continue;	//for debugging

	//switch clock - not all clock sources show (LPRC)
	//SystemCoreClockPOSC();					//switch to primary oscillator
	//SystemCoreClockPOSCPLL();					//switch to primary oscillator x PLL
	//SystemCoreClockFRC();						//switch to FRC
	//SystemCoreClockFRCPLL();					//switch to FRCxPLL

#if defined(FRCTRIM)
	FRCSetTrim(FRCTRIM);						//tune the frc
#endif	//frctrim

	//powering up on FRC (default)
	//set poster scaler for FRC (default 2:1), for FRCDIV
	CLKDIVbits.FRCDIV=0;						//rc divider (0..7->1:1..128:1): 0->1:1 (default), 1->2:1, 2->4:1, 3=8:1, ...

	//turn off all peripherals by setting the bits to 1
	PMD1=0xffff;
	PMD2=0xffff;
	PMD3=0xffff;

	//all pins digital
	AD1PCFGL = 0xffff;							//1->all pins digital

#if defined(SYSTICK_TMR1)						//Systick running on tmr1
	//initialize tmr1 for tick/pwm generation - do not stop this
	//PMD1bits.T1MD = 0;							//0->enable the peripheral, 1->disable the peripheral
	tmr1Init(TMR_PS1x);							//reset the timer
	IFS0bits.T1IF = 0;							//reset the flag
	IPC0bits.T1IP = TxIP_DEFAULT;
	//IPC0bits.T2IS = TxIS_DEFAULT;
	IEC0bits.T1IE = 1;							//0->disable tmr2 isr, 1->enable tmr2 isr
	//T1CONbits.TON = 1;			 			//turn on the timer
#else											//systick running on tmr2
	//initialize tmr2 for tick/pwm generation - do not stop this
	//PMD1bits.T2MD = 0;							//0->enable the peripheral, 1->disable the peripheral
	tmr2Init(TMR_PS1x);							//reset the timer
	IFS0bits.T2IF = 0;							//reset the flag
	IPC1bits.T2IP = TxIP_DEFAULT;
	//IPC1bits.T2IS = TxIS_DEFAULT;
	IEC0bits.T2IE = 1;							//0->disable tmr2 isr, 1->enable tmr2 isr
	//T2CONbits.TON = 1;			 				//turn on the timer
#endif		//systick on tmr1 or tmr2

	//update SystemCoreClock
	SystemCoreClockUpdate();					//update system core clock

	//enable global interrupts
	ei();										//testing

}

//empty interrupt handler
void empty_handler(void) {
	//do nothing here
}

//C main loop
#ifndef USE_MAIN
int main(void) {

	mcuInit();						//reset the mcu
	setup();						//run the setup code
	while (1) {
		loop();						//run the default loop
	}
}
#endif	//use_main

//Arduino Functions: GPIO
void pinPullup(PIN_TypeDef pin) {
   	switch (pin) {
   		case PA4: REG_SET(CNPU1, 1<<0 ); break;	//PA4=CN0
   		case PB4: REG_SET(CNPU1, 1<<1 ); break;	//PB4=CN1
   		case PA0: REG_SET(CNPU1, 1<<2 ); break;	//PA0=CN2
   		case PA1: REG_SET(CNPU1, 1<<3 ); break;	//PA1=CN3
   		case PB0: REG_SET(CNPU1, 1<<4 ); break;	//PB0=CN4
   		case PB1: REG_SET(CNPU1, 1<<5 ); break;	//PB1=CN5
   		case PB2: REG_SET(CNPU1, 1<<6 ); break;	//PB2=CN6
   		case PB3: REG_SET(CNPU1, 1<<7 ); break;	//PB3=CN7
#if defined(GPIOC)
   		case PC0: REG_SET(CNPU1, 1<<8 ); break;	//PC0=CN8
   		case PC1: REG_SET(CNPU1, 1<<9 ); break;	//PC1=CN9
   		case PC2: REG_SET(CNPU1, 1<<10); break;	//PC2=CN10
#endif
   		case PB15:REG_SET(CNPU1, 1<<11); break;	//PB15=CN11
   		case PB14:REG_SET(CNPU1, 1<<12); break;	//PB14=CN12
   		case PB13:REG_SET(CNPU1, 1<<13); break;	//PB13=CN13
   		case PB12:REG_SET(CNPU1, 1<<14); break;	//PB12=CN14
   		case PB11:REG_SET(CNPU1, 1<<15); break;	//PB11=CN15
   		case PB10:REG_SET(CNPU2, 1<<0 ); break;	//PB10=CN16
#if defined(GPIOC)
   		case PC7: REG_SET(CNPU2, 1<<1 ); break;	//PC7=CN17
   		case PC6: REG_SET(CNPU2, 1<<2 ); break;	//PC6=CN18
   		case PC9: REG_SET(CNPU2, 1<<3 ); break;	//PC9=CN19
   		case PC8: REG_SET(CNPU2, 1<<4 ); break;	//PC8=CN20
#endif
   		case PB9: REG_SET(CNPU2, 1<<5 ); break;	//PB9=CN21
   		case PB8: REG_SET(CNPU2, 1<<6 ); break;	//PB8=CN22
   		case PB7: REG_SET(CNPU2, 1<<7 ); break;	//PB7=CN23
   		case PB6: REG_SET(CNPU2, 1<<8 ); break;	//PB6=CN24
#if defined(GPIOC)
   		case PC4: REG_SET(CNPU2, 1<<0 ); break;	//PC4=CN25
   		case PC5: REG_SET(CNPU2, 1<<10); break;	//PC5=CN26
#endif
   		case PB5: REG_SET(CNPU2, 1<<11); break;	//PB5=CN27
#if defined(GPIOC)
   		case PC3: REG_SET(CNPU2, 1<<12); break;	//PC3=CN28
#endif
   		case PA3: REG_SET(CNPU2, 1<<13); break;	//PA3=CN29
   		case PA2: REG_SET(CNPU2, 1<<14); break;	//PA2=CN30
   		//case PB5: REG_SET(CNPU2, 1<<15); break;	//PC3=CN31
   		default: break;							//do nothing if the pin isn't a CN pin
   	};
}

