dannyf00/Ghetto-GPSDO/v0.6c/dspic33duino.c
//enable pulldown - not available on pic24
void pinPulldown(PIN_TypeDef pin) {
}


//set a pin mode to INPUT or OUTPUT
//no error checking on PIN
inline void pinMode(PIN_TypeDef pin, uint8_t mode) {
	//if (mode==OUTPUT) GIO_OUT(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	//else GIO_IN(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	//GPIO_TypeDef *gpio;
	//uint16_t mask;

	//gpio = GPIO_PinDef[pin].gpio;
	//mask = GPIO_PinDef[pin].mask;

	GPIO_TypeDef *gpio = GPIO_PinDef[pin].gpio;
	uint16_t mask = GPIO_PinDef[pin].mask;
	switch (mode) {
		case INPUT_PULLUP:		pinPullup(pin);	IO_IN(gpio, mask); break;
		case INPUT_PULLDOWN: 	pinPulldown(pin); IO_IN(gpio, mask); break;
		case INPUT:				IO_IN(gpio, mask); break;
		case OUTPUT_OD:			pinPullup(pin);	REG_SET(gpio->ODC, mask); IO_OUT(gpio, mask); break;
		case OUTPUT:			IO_OUT(gpio, mask); break;
		default: break;
	}
}

inline void digitalWrite(PIN_TypeDef pin, uint8_t val) {
	GPIO_TypeDef *gpio = GPIO_PinDef[pin].gpio;
	uint16_t mask = GPIO_PinDef[pin].mask;
	if (val==LOW) GIO_CLR(gpio, mask); else GIO_SET(gpio, mask);
}

//read a pin
inline int digitalRead(PIN_TypeDef pin) {
	return (GIO_GET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask))?HIGH:LOW;
}
//end GPIO

//ticks()
//Arduino Functions: Time
//return timer ticks
uint32_t systicks(void) {
	volatile uint32_t m;					//stores overflow count
	volatile uint16_t f;					//return the fractions / TMR1 value

	//use double reads
	do {
		m = systick_ovf;
#if defined(SYSTICK_TMR1)
		f = TMR1;
#else
		f = TMR2;
#endif	//systick_tmr1
	} while (m != systick_ovf);
	//now m and f are consistent
	return (m | f);
}

//delay millisseconds
//void delay(uint32_t ms) {
//	uint32_t start_time = ticks();
//	ms *= cyclesPerMillisecond();
//	while (ticks() - start_time < ms) continue;
//}

//delay micros seconds
//void delayMicroseconds(uint32_t us) {
//	uint32_t start_time = ticks();
//	us *= cyclesPerMicrosecond();
//	while (ticks() - start_time < us) continue;
//}

//delay ticks
void delayTks(uint32_t tks) {
	uint32_t start_time = ticks();
	while (ticks() - start_time < tks) continue;
}
//end Time

//generic print to uart buffer
void uPrint(char *uRAM, int32_t dat) {
	uint8_t idx=20;						//buffer index
	uint8_t negFlag=0;					//flag for negative sign: 1->negative, 0->positive

	if (dat<0) {negFlag = 1; dat = -dat;}
#if 0	//10k/invocation
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]=',';	//'0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]=',';	//'0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]=',';	//'0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
#else	//6k/invocation
	uint32_t tmp;

	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	                      uRAM[idx--]=',';
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	                      uRAM[idx--]=',';
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	                      uRAM[idx--]=',';
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
#endif
	uRAM[idx--]=negFlag?'-':' ';
}

//static char uRAM[uRAM_SIZE];			//transmission buffer
//uart1
#if defined(UART1_TXISR)
CB_TypeDef U1TXBuf;						//circular buffer for uart1 tx
//uart1 isr
//volatile char *_U1TX_ptr;
//volatile unsigned char _U1TX_BUSY=0;	//0=u1 transmission done, 1=u1 transmission in process

//ux transmit isr
//'\0' is now transmitted
//void _ISR _U1TXInterrupt(void) {
void _ISR_PSV _U1TXInterrupt(void) {
	//char tmp;
	//TX only, RX not implemented
	IFS0bits.U1TXIF = 0;				//UxTXIF = 0;							//clear the flag
	if (!cbEmpty(&U1TXBuf)) {			//if (*_U1TX_ptr) {					//0 indicates the end of the string
		//_UxTX_ptr;					//increment to the next char
		//tmp = *_UxTX_ptr++; UxTXREG = tmp;
		U1TXREG = cbRead(&U1TXBuf);	//U1TXREG = *_U1TX_ptr++;			//load up a char to be transmitted
		//NOP();
		//IFS0bits.U1TXIF = 0;			//UxTXIF = 0;						//clear the flag
	} else {
		//UxSTA.UTXEN = 0;				//turn off the transmission
		IEC0bits.U1TXIE = 0;			//UxTXIE = 0;						//disable the interrupt
		//_U1TX_BUSY = 0;				//transmission done
	}
	//IFS0bits.U1TXIF = 0;				//clear the flag
}
#endif		//UART1_TXISR

//initialize usart: high baudrate (brgh=1), 16-bit baudrate (brg16=1)
//baudrate=Fxtal/(4*(spbrg+1))
//spbrg=(Fxtal/4/baudrate)-1
//tx/rx pins to be assumed in gpio mode
//data bits: 	8
//parity: 		none
//stop bits: 	1
//Xon/Xoff:		none
void uart1Init(unsigned long baud_rate) {
	//enable the pins
#if defined(U1RX2RP)
	U1RX2RP();					//PPS_U1RX_TO_RP(U1RX_RP);
#endif

#if defined(U1TX2RP)
	U1TX2RP();					//PPS_U1TX_TO_RP();
#endif

#if defined(UART1_TXISR)
	cbInit(&U1TXBuf);				//initialize uart1 tx circular buffer
#endif	//uart1_txisr

	//disable md bits
	PMD1bits.U1MD = 0;				//power up the module

	//U2MODEbits register
	//bit 15 UARTEN: UARTx Enable bit(1)
	//1 = UARTx is enabled; all UARTx pins are controlled by UARTx as defined by UEN<1:0>
	//0 = UARTx is disabled; all UARTx pins are controlled by PORT latches; UARTx power consumption is	minimal
	U1MODEbits.UARTEN=1;	//enable the uart module
	//bit 14 Unimplemented: Read as `0'
	//bit 13 USIDL: Stop in Idle Mode bit
	//1 = Discontinue module operation when device enters Idle mode
	//0 = Continue module operation in Idle mode
	//bit 12 IREN: IrDAr Encoder and Decoder Enable bit(2)
	//1 = IrDA encoder and decoder enabled
	//0 = IrDA encoder and decoder disabled
	U1MODEbits.IREN = 0;		//disable irda
	U1MODEbits.RTSMD = 0;		//1=in simplex mode. 0 = no flow control
	//bit 11 RTSMD: Mode Selection for UxRTS Pin bit
	//1 = UxRTS pin in Simplex mode
	//0 = UxRTS pin in Flow Control mode
	//bit 10 Unimplemented: Read as `0'
	//bit 9-8 UEN1:UEN0: UARTx Enable bits(3)
	//11 = UxTX, UxRX and BCLKx pins are enabled and used; UxCTS pin controlled by PORT latches
	//10 = UxTX, UxRX, UxCTS and UxRTS pins are enabled and used
	//01 = UxTX, UxRX and UxRTS pins are enabled and used; UxCTS pin controlled by PORT latches
	//00 = UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/BCLKx pins controlled by PORT latches
	U1MODEbits.UEN1=0, U2MODEbits.UEN0=0;
	//bit 7 WAKE: Wake-up on Start Bit Detect During Sleep Mode Enable bit
	//1 = UARTx will continue to sample the UxRX pin; interrupt generated on falling edge, bit cleared in hardware on following rising edge
	//0 = No wake-up enabled
	U1MODEbits.WAKE = 0;
	//bit 6 LPBACK: UARTx Loopback Mode Select bit
	//1 = Enable Loopback mode
	//0 = Loopback mode is disabled
	U1MODEbits.LPBACK = 0;
	//bit 5 ABAUD: Auto-Baud Enable bit
	//1 = Enable baud rate measurement on the next character - requires reception of a Sync field (55h); cleared in hardware upon completion
	//0 = Baud rate measurement disabled or completed
	U1MODEbits.ABAUD = 0;
	//bit 4 RXINV: Receive Polarity Inversion bit
	//1 = UxRX Idle state is `0'
	//0 = UxRX Idle state is `1'
	U1MODEbits.URXINV = 0;
	//bit 3 BRGH: High Baud Rate Enable bit
	//1 = BRG generates 4 clocks per bit period (4x baud clock, High-Speed mode)
	//0 = BRG generates 16 clocks per bit period (16x baud clock, Standard mode)
	U1MODEbits.BRGH = (F_UART / 4 / baud_rate < 0xffff)?1:0;	//U1MODEbits.BRGH = 1;
	//bit 2-1 PDSEL1:PDSEL0: Parity and Data Selection bits
	//11 = 9-bit data, no parity
	//10 = 8-bit data, odd parity
	//01 = 8-bit data, even parity
	//00 = 8-bit data, no parity
	U1MODEbits.PDSEL1=0, U1MODEbits.PDSEL0=0;
	//bit 0 STSEL: Stop Bit Selection bit
	//1 = Two Stop bits
	//0 = One Stop bit
	U1MODEbits.STSEL=0;
	//Note 1: If UARTEN = 1, the peripheral inputs and outputs must be configured to an available RPn pin. See
	//Section 10.4 "Peripheral Pin Select" for more information.
	//2: This feature is only available for the 16x BRG mode (BRGH = 0).
	//3: Bit availability depends on pin availability.

#if 1	//BAUDCON - with rounding up
	if (U1MODEbits.BRGH==1) U1BRG = (F_UART + 2 * baud_rate) / 4 / baud_rate - 1;				//set lower byte of brg
	else U1BRG = (F_UART + 8 * baud_rate) / 16 / baud_rate - 1;
#else	//BAUDCON - without rounding up
	if (U1MODEbits.BRGH==1) U1BRG = (F_UART + 0*2 * baud_rate) / 4 / baud_rate - 1;				//set lower byte of brg
	else U1BRG = (F_UART + 0*8 * baud_rate) / 16 / baud_rate - 1;
#endif

	//disable interrupts

	//set up status register
//#if defined(UxTX2RP)				//tx is used
	IFS0bits.U1TXIF = 0;						//clera the flag
	IEC0bits.U1TXIE = 0;						//disable the interrupt
	IPC3bits.U1TXIP = UxIP_DEFAULT;				//set priority

	//bit 15,13 UTXISEL1:UTXISEL0: Transmission Interrupt Mode Selection bits
	//11 = Reserved; do not use
	//10 = Interrupt when a character is transferred to the Transmit Shift Register (TSR) and as a result, the transmit buffer becomes empty
	//01 = Interrupt when the last character is shifted out of the Transmit Shift Register; all transmit operations are completed
	//00 = Interrupt when a character is transferred to the Transmit Shift Register (this implies there is at least one character open in the transmit buffer)
	U1STAbits.UTXISEL1=0, U1STAbits.UTXISEL0=0;
//#endif
	//bit 14 UTXINV: IrDAr Encoder Transmit Polarity Inversion bit
	//If IREN = 0:
	//1 = UxTX Idle `0'
	//0 = UxTX Idle `1'
	//If IREN = 1:
	//1 = UxTX Idle `1'
	//0 = UxTX Idle `0'
	U1STAbits.UTXINV=0;
	//bit 12 Unimplemented: Read as `0'
	//bit 11 UTXBRK: Transmit Break bit
	//1 = Send Sync Break on next transmission - Start bit, followed by twelve `0' bits, followed by Stop bit;	cleared by hardware upon completion
	//0 = Sync Break transmission disabled or completed
	U1STAbits.UTXBRK=0;
	//bit 10 UTXEN: Transmit Enable bit(1)
	//1 = Transmit enabled, UxTX pin controlled by UARTx
	//0 = Transmit disabled, any pending transmission is aborted and buffer is reset. UxTX pin controlled by the PORT register.
#if defined(U1TX2RP)
	U1STAbits.UTXEN=1;
#else
	U1STAbits.UTXEN=0;
#endif
#if defined(U1RX2RP)
	//U1STAbits.URXEN=1;
#else
	//U1STAbits.URXEN=0;
#endif
	//bit 9 UTXBF: Transmit Buffer Full Status bit (read-only)
	//1 = Transmit buffer is full
	//0 = Transmit buffer is not full, at least one more character can be written
	//bit 8 TRMT: Transmit Shift Register Empty bit (read-only)
	//1 = Transmit Shift Register is empty and transmit buffer is empty (the last transmission has completed)
	//0 = Transmit Shift Register is not empty, a transmission is in progress or queued
//#if defined(UxRX2RP)
	IFS0bits.U1RXIF = 0;						//clear the flag
	IEC0bits.U1RXIE = 0;						//disable the interrupt

	//bit 7-6 URXISEL1:URXISEL0: Receive Interrupt Mode Selection bits
	//11 = Interrupt is set on RSR transfer, making the receive buffer full (i.e., has 4 data characters)
	//10 = Interrupt is set on RSR transfer, making the receive buffer 3/4 full (i.e., has 3 data characters)
	//0x = Interrupt is set when any character is received and transferred from the RSR to the receive buffer. Receive buffer has one or more characters.
	U1STAbits.URXISEL1 = 0, U1STAbits.URXISEL0 = 0;
//#endif
	//bit 5 ADDEN: Address Character Detect bit (bit 8 of received data = 1)
	//1 = Address Detect mode enabled. If 9-bit mode is not selected, this does not take effect.
	//0 = Address Detect mode disabled
	//bit 4 RIDLE: Receiver Idle bit (read-only)
	//1 = Receiver is Idle
	//0 = Receiver is active
	//bit 3 PERR: Parity Error Status bit (read-only)
	//1 = Parity error has been detected for the current character (character at the top of the receive FIFO)
	//0 = Parity error has not been detected
	//bit 2 FERR: Framing Error Status bit (read-only)
	//1 = Framing error has been detected for the current character (character at the top of the receive FIFO)
	//0 = Framing error has not been detected
	//bit 1 OERR: Receive Buffer Overrun Error Status bit (clear/read-only)
	//1 = Receive buffer has overflowed
	//0 = Receive buffer has not overflowed (clearing a previously set OERR bit (1 ? 0 transition) will reset the receiver buffer and the RSR to the empty state)
	//bit 0 URXDA: Receive Buffer Data Available bit (read-only)
	//1 = Receive buffer has data; at least one more character can be read
	//0 = Receive buffer is empty
	//REGISTER 17-2: U1STAbits: UARTx STATUS AND CONTROL REGISTER (CONTINUED)
	//Note 1: If UARTEN = 1, the peripheral inputs and outputs must be configured to an available RPn pin. See
	//Section 10.4 "Peripheral Pin Select" for more information.
}

//put a string
void uart1Puts(char *str) {
#if defined(UART1_TXISR)
	//interrupt transmission
	if (*str) {								//if the string isn't empty to begin with
		//uart1Wait();						//for compatability with polling transmission
		//U1TXREG = 0;						//clear the buffer
		//_U1TX_BUSY  = 1;					//transmission in progress
		str2cb(&U1TXBuf, str);				//_U1TX_ptr=str;						//point to the string to be transmitted
		if (IEC0bits.U1TXIE == 0) {
			//U1STAbits.UTXEN = 1;				//enable transmission - always enabled
			//tmp = *_UxTX_ptr++;	UxTXREG = tmp;						//*_UxTX_ptr++;				//load up the 1st char. advance to the next char
			IFS0bits.U1TXIF = 0;				//UxTXIF = 0;							//clear the flag
			IEC0bits.U1TXIE = 1;				//UxTXIE = 1;							//enable the interrupt
			U1TXREG = cbRead(&U1TXBuf);			//U1TXREG = *_U1TX_ptr++;
		}
	}
#else
	//polling transmission
	while(*str) {
		uart1Putch(*str++);	//send the ch and advance the pointer
	}
#endif	//UART1_TXISR
}
/*

Writes a line of text to USART and goes to new line
The new line is Windows style CR/LF pair.

This will work on Hyper Terminal Only NOT on Linux

*/

