dannyf00/Ghetto-GPSDO/v0.6c/dspic33duino.c
}

void uart2Puts(char *str) {
#if defined(UART2_TXISR)
	//interrupt transmission
	if (*str) {								//if the string isn't empty to begin with
		//uart2Wait();						//for compatability with polling transmission
		//U1TXREG = 0;						//clear the buffer
		//_U1TX_BUSY  = 1;					//transmission in progress
		str2cb(&U2TXBuf, str);				//_U2TX_ptr=str;						//point to the string to be transmitted
		if (IEC1bits.U2TXIE==0) {
			//U1STAbits.UTXEN = 1;				//enable transmission - always enabled
			//tmp = *_UxTX_ptr++;	UxTXREG = tmp;						//*_UxTX_ptr++;				//load up the 1st char. advance to the next char
			IFS1bits.U2TXIF = 0;				//UxTXIF = 0;							//clear the flag
			IEC1bits.U2TXIE = 1;				//UxTXIE = 1;							//enable the interrupt
			U2TXREG = cbRead(&U2TXBuf);			//U2TXREG = *_U2TX_ptr++;
		}
	}
#else
	//polling implementation
	while(*str) {
		uart2Putch(*str++);	//send the ch and advance the pointer
	}
#endif	//UART2_TXISR
}

/*

Writes a line of text to USART and goes to new line
The new line is Windows style CR/LF pair.

This will work on Hyper Terminal Only NOT on Linux

*/

//void uart2Putline(char *ln) {
//	//USARTWriteString(ln);
//	uart2Puts(ln);
//	//USARTWriteString("\r\n");
//	uart2Puts((char *)"\r\n");
//}

//uint8_t uart2Getch(void) {
//	//while(!RCIF); RCIF=0;		//Wait for a byte
//   //USART_WAIT(U1STAbits.TRMT);		//wait for the prior transmission to end
//
//	return U2RXREG;		//return it
//}

//test if data rx is available
//uint16_t uart2Available(void) {
//	return U2STAbits.URXDA;
//}

//test if uart tx is busy
//uint16_t uart2Busy(void) {
//	return U2STAbits.UTXBF;
//}

//print to uart2
void u2Print(char *str, int32_t dat) {
	/*static*/ char uRAM[uRAM_SIZE];						//transmission buffer, 40-1 char max

	//uart2Wait();						//wait for complete
	//while (cbFull(&U2TXBuf));			//wait for tx buffer to free up

	strcpy(uRAM, str);					//copy to uarm
	uPrint(uRAM, dat);					//print to ubuffer
	uart2Puts(uRAM);					//send a message on uart1
}

//end Serial

//tmr1
//global variables
static void (* _tmr1_isrptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler by default

//interrupt service routine
void _ISR_PSV _T1Interrupt(void) {
	IFS0bits.T1IF=0;							//clear tmr1 interrupt flag
#if defined(SYSTICK_TMR1)
	systick_ovf+=tmr1GetPR();					//0x10000ul;						//increment overflow count: 16-bit timer. or PR1 + 1
#else	//systick on tmr2
	//do nothing
#endif
	_tmr1_isrptr();								//execute user tmr1 isr
}

//initialize the timer1 (16bit)
void tmr1Init(uint8_t ps) {
	_tmr1_isrptr=empty_handler;					//point to default handler

	PMD1bits.T1MD = 0;							//enable power to tmr

	//tmrInit(TIM1, ps);							//reset the timer
	T1CONbits.TON = 0;							//turn off rtc1
	T1CONbits.TCS = 0;							//use internal clock = Fosc
	//T1CONbits.T32 = 0;							//0->16 bit timer, 1->32bit timer
	T1CONbits.TCKPS=ps & TMR_PSMASK;				//set prescaler to 1:1
	T1CONbits.TGATE = 0;							//rtc1 gate disabled
	PR1 = -1;									//set period

	IFS0bits.T1IF = 0;							//reset the flag
	IEC0bits.T1IE = 0;							//rtc1 interrupt off

	T1CONbits.TON = 1;							//turn on rtc1

	//configure timer input pin (TxCK)
#if defined(T1CK2RP)
	T1CK2RP();									//configure the input pin
	T1CONbits.TCS = 1;							//1->use TxCK as input, 0->se internal clock = Fosc
#endif
}

//activate the isr handler
void tmr1AttachISR(void (*isrptr)(void)) {
	_tmr1_isrptr=isrptr;						//activate the isr handler
	IPC0bits.T1IP = TxIP_DEFAULT;
	//IPC0bits.T1IS = TxIS_DEFAULT;
	IFS0bits.T1IF = 0;							//reset the flag
	IEC0bits.T1IE = 1;							//rtc1 interrupt on
}

//tmr2
//global variables
static void (* _tmr2_isrptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler by default

//interrupt service routine
void _ISR_PSV _T2Interrupt(void) {
	IFS0bits.T2IF=0;							//clear tmr1 interrupt flag
#if defined(SYSTICK_TMR1)
	//do nothing
#else	//systick on tmr2
	systick_ovf+=tmr2GetPR();					//0x10000ul;						//increment overflow count: 16-bit timer. or PR2+1
#endif
	_tmr2_isrptr();								//execute user tmr2 isr
}

//initialize the timer2 (16bit)
void tmr2Init(uint8_t ps) {
	_tmr2_isrptr=empty_handler;					//point to default handler

	PMD1bits.T2MD = 0;							//enable power to tmr
	//tmrInit(TIM2, ps);							//reset the timer
	T2CONbits.TON = 0;							//turn off rtc1
	T2CONbits.TCS = 0;							//use internal clock = Fosc
	T2CONbits.T32 = 0;							//0->16 bit timer, 1->32bit timer
	T2CONbits.TCKPS=ps & TMR_PSMASK;				//set prescaler to 1:1
	T2CONbits.TGATE = 0;							//rtc1 gate disabled
	PR2 = -1;									//set period

	IFS0bits.T2IF = 0;							//reset the flag
	IEC0bits.T2IE = 0;							//rtc1 interrupt off

	T2CONbits.TON = 1;							//turn on rtc1

	//configure timer input pin (TxCK)
#if defined(T2CK2RP)
	T2CK2RP();									//configure the input pin
	T2CONbits.TCS = 1;							//1->use TxCK as input, 0->se internal clock = Fosc
#endif
}

//activate the isr handler
void tmr2AttachISR(void (*isrptr)(void)) {
	_tmr2_isrptr=isrptr;						//activate the isr handler
	IPC1bits.T2IP = TxIP_DEFAULT;
	//IPC2bits.T2IS = TxIS_DEFAULT;
	IFS0bits.T2IF = 0;							//reset the flag
	IEC0bits.T2IE = 1;							//rtc1 interrupt on
}

//tmr3
//global variables
static void (* _tmr3_isrptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler by default

//interrupt service routine
void _ISR_PSV _T3Interrupt(void) {
	IFS0bits.T3IF=0;							//clear tmr1 interrupt flag
	_tmr3_isrptr();								//execute user tmr1 isr
}

//initialize the timer3 (16bit)
void tmr3Init(uint8_t ps) {
	_tmr3_isrptr=empty_handler;					//point to default handler

	PMD1bits.T3MD = 0;							//enable power to tmr
	//tmrInit(TIM3, ps);							//reset the timer
	T3CONbits.TON = 0;							//turn off rtc1
	T3CONbits.TCS = 0;							//use internal clock = Fosc
	//T3CONbits.T32 = 0;							//0->16 bit timer, 1->32bit timer
	T3CONbits.TCKPS=ps & TMR_PSMASK;				//set prescaler to 1:1
	T3CONbits.TGATE = 0;							//rtc1 gate disabled
	PR3 = -1;									//set period

	IFS0bits.T3IF = 0;							//reset the flag
	IEC0bits.T3IE = 0;							//rtc1 interrupt off

	T3CONbits.TON = 1;							//turn on rtc1

