dannyf00/Ghetto-GPSDO/v0.6c/dspic33duino.c
	//configure timer input pin (TxCK)
#if defined(T3CK2RP)
	T3CK2RP();									//configure the input pin
	T3CONbits.TCS = 1;							//1->use TxCK as input, 0->se internal clock = Fosc
#endif
}

//activate the isr handler
void tmr3AttachISR(void (*isrptr)(void)) {
	_tmr3_isrptr=isrptr;						//activate the isr handler
	IPC2bits.T3IP = TxIP_DEFAULT;
	//IPC2bits.T3IS = TxIS_DEFAULT;
	IFS0bits.T3IF = 0;							//reset the flag
	IEC0bits.T3IE = 1;							//rtc1 interrupt on
}

//tmr4
//global variables
static void (* _tmr4_isrptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler by default

//interrupt service routine
void _ISR_PSV _T4Interrupt(void) {
	IFS1bits.T4IF=0;							//clear tmr1 interrupt flag
	_tmr4_isrptr();								//execute user tmr1 isr
}

//initialize the timer4 (16bit)
void tmr4Init(uint8_t ps) {
	_tmr4_isrptr=empty_handler;					//point to default handler

	PMD1bits.T4MD = 0;							//enable power to tmr
	//tmrInit(TIM4, ps);							//reset the timer
	T4CONbits.TON = 0;							//turn off rtc1
	T4CONbits.TCS = 0;							//use internal clock = Fosc
	T4CONbits.T32 = 0;							//0->16 bit timer, 1->32bit timer
	T4CONbits.TCKPS=ps & TMR_PSMASK;				//set prescaler to 1:1
	T4CONbits.TGATE = 0;							//rtc1 gate disabled
	PR4 = -1;									//set period

	IFS1bits.T4IF = 0;							//reset the flag
	IEC1bits.T4IE = 0;							//rtc1 interrupt off

	T4CONbits.TON = 1;							//turn on rtc1

	//configure timer input pin (TxCK)
#if defined(T4CK2RP)
	T4CK2RP();									//configure the input pin
	T4CONbits.TCS = 1;							//1->use TxCK as input, 0->se internal clock = Fosc
#endif
}

//activate the isr handler
void tmr4AttachISR(void (*isrptr)(void)) {
	_tmr4_isrptr=isrptr;						//activate the isr handler
	IPC6bits.T4IP = TxIP_DEFAULT;
	//IPC6bits.T4IS = TxIS_DEFAULT;
	IFS1bits.T4IF = 0;							//reset the flag
	IEC1bits.T4IE = 1;							//rtc1 interrupt on
}

//tmr5
//global variables
static void (* _tmr5_isrptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler by default

//interrupt service routine
void _ISR_PSV _T5Interrupt(void) {
	IFS1bits.T5IF=0;							//clear tmr1 interrupt flag
	_tmr5_isrptr();								//execute user tmr1 isr
}

//initialize the timer5 (16bit)
void tmr5Init(uint8_t ps) {
	_tmr5_isrptr=empty_handler;					//point to default handler

	PMD1bits.T5MD = 0;							//enable power to tmr
	//tmrInit(TIM5, ps);							//reset the timer
	T5CONbits.TON = 0;							//turn off rtc1
	T5CONbits.TCS = 0;							//use internal clock = Fosc
	//T5CONbits.T32 = 0;							//0->16 bit timer, 1->32bit timer
	T5CONbits.TCKPS=ps & TMR_PSMASK;				//set prescaler to 1:1
	T5CONbits.TGATE = 0;							//rtc1 gate disabled
	PR5 = -1;									//set period

	IFS1bits.T5IF = 0;							//reset the flag
	IEC1bits.T5IE = 0;							//rtc1 interrupt off

	T5CONbits.TON = 1;							//turn on rtc1

	//configure timer input pin (TxCK)
#if defined(T5CK2RP)
	T5CK2RP();									//configure the input pin
	T5CONbits.TCS = 1;							//1->use TxCK as input, 0->se internal clock = Fosc
#endif
}

//activate the isr handler
void tmr5AttachISR(void (*isrptr)(void)) {
	_tmr5_isrptr=isrptr;						//activate the isr handler
	IPC7bits.T5IP = TxIP_DEFAULT;
	//IPC7bits.T5IS = TxIS_DEFAULT;
	IFS1bits.T5IF = 0;							//reset the flag
	IEC1bits.T5IE = 1;							//rtc1 interrupt on
}

//set up 32-bit timer
//using tmr2 (lsw) and tmr3 (msw)
void tmr23Init(uint8_t ps) {
	//period = period - 1 ;
	tmr2Init(ps);
	tmr3Init(TMR_PS1x);
	T2CONbits.T32=1;							//1->as 32-bit timer

	TMR2 = TMR3 = 0;							//reset the timer
}

//read 32-bit timer2 and 3
uint32_t tmr23Get(void) {
	uint16_t lsw, msw;

	do {
		msw = TMR3;								//read the mws
		lsw = TMR2;								//read the lsw
	} while (msw ^ TMR2);

	return ((uint32_t) msw << 16) | lsw;
}

//#define tmr23AttachISR(isr)				tmr3AttachISR(isr)

//using tmr4 (lsw) and tmr5 (msw)
void tmr45Init(uint8_t ps) {
	//period = period - 1;
	tmr4Init(ps);
	tmr5Init(TMR_PS1x);
	T4CONbits.T32=1;							//1->as 32-bit timer

	TMR4 = TMR5 = 0;							//reset the timer
}

//read 32-bit timer4 and 5
uint32_t tmr45Get(void) {
	uint16_t lsw, msw;

	do {
		msw = TMR5;								//read the mws
		lsw = TMR4;								//read the lsw
	} while (msw ^ TMR5);

	return ((uint32_t) msw << 16) | lsw;
}

//#define tmr45AttachISR(isr)				tmr5AttachISR(isr)
//end Timer

//define pwm functions
//time base is Timer2, defined in mcu_init()

//pwm1/oc1
//reset pwm
void pwm1Init(void) {
	//power up the pwm module
	PMD2bits.OC1MD = 0;							//0->turn on the peripheral, 1->turn off the peripheral

	//for GA002 chips
	//OCxCON1 register settings
	//reset the registers
	OC1CON = 0x0000;
	//OC1CON2 = 0x0000;
	OC1CONbits.OCM = 0x06;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled
	OC1CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
	OC1R = OC1RS = 0;						//reset the duty cycle registers
	//OC1CON1bits.ON= 1;					//1->turn on oc, 0->turn off oc

#if defined(PWM12RP)
	//assign the output pins
	PWM12RP();
#endif

	//tris pin presumed to have been set to output


}

//pwm2/oc2
//reset pwm
void pwm2Init(void) {
	//power up the pwm module
	PMD2bits.OC2MD = 0;						//0->turn on the peripheral, 1->turn off the peripheral

	//for ga002 devices
	//OCxCON1 register settings
	//reset the registers
	OC2CON = 0x0000;
	//OC2CON2 = 0x0000;
	OC2CONbits.OCM = 0x06;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled
	OC2CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
	OC2R = OC2RS = 0;						//reset the duty cycle registers
	//OC2CON1bits.ON= 1;					//1->turn on oc, 0->turn off oc

#if defined(PWM22RP)
	//assign the output pins
	PWM22RP();
#endif

	//tris pin presumed to have been set to output


}


//pwm3/oc3
//reset pwm
void pwm3Init(void) {
	//power up the pwm module
	PMD2bits.OC3MD = 0;						//0->turn on the peripheral, 1->turn off the peripheral

