dannyf00/Ghetto-GPSDO/v0.6c/dspic33duino.c
	//for ga002 devices
	//OCxCON1 register settings
	//reset the registers
	OC3CON = 0x0000;
	//OC3CON2 = 0x0000;
	OC3CONbits.OCM = 0x06;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled
	OC3CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
	OC3R = OC3RS = 0;						//reset the duty cycle registers
	//OC3CON1bits.ON= 1;					//1->turn on oc, 0->turn off oc

	//tris pin presumed to have been set to output
#if defined(PWM32RP)
	//assign the output pins
	PWM32RP();
#endif

}


//pwm4/oc4
//reset pwm
void pwm4Init(void) {
	//power up the pwm module
	PMD2bits.OC4MD = 0;						//0->turn on the peripheral, 1->turn off the peripheral

	//for ga002 devices
	//OCxCON1 register settings
	//reset the registers
	OC4CON = 0x0000;
	//OC4CON2 = 0x0000;
	OC4CONbits.OCM = 0x06;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled
	OC4CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
	OC4R = OC4RS = 0;						//reset the duty cycle registers
	//OC4CON1bits.ON= 1;					//1->turn on oc, 0->turn off oc

#if defined(PWM42RP)
	//assign the output pins
	PWM42RP();
#endif

	//tris pin presumed to have been set to output

}

//end pwm/oc

//adc module
//rest the adc
//automatic sampling (ASAM=1), manual conversion
//12-bit adc, ch0 only
void adcInit(void) {
	PMD1bits.AD1MD = 0;					//enable power to adc

	//reset the adc control registers
	AD1CON1 = 0;							//AVdd-AVss
	AD1CON1bits.AD12B=1;					//1->12bit adc, 0->10bit adc
	AD1CON2 = 0;							//convert ch0 only
	AD1CON3 = 0;
	AD1CON4 = 0;							//allocate 1 word for each channel
	AD1CHS123=0;							//default value
	AD1CHS0 = 0;							//negative input is Vref-(=AVss)

	AD1CON1bits.SSRC = 7;					//0->samp ends sampling and starts conversion. 7=auto mode
	AD1CON2bits.VCFG = 0;					//0..7. adc reference: 0->AVdd-AVss,1=Vref+-AVss, 2=AVdd-Vref-, 3=Vref+ - Vref-
	AD1CON2bits.ALTS = 0;					//0->always use mux A inputs. 1->alternate between mux a and mux b inputs
	AD1CON3bits.SAMC = 31;					//0..31. 0->0 Tad (not recommended), 1->1 Tad, ... 31->32 Tad
	AD1CON3bits.ADCS = 2;					//0..63. 0->Tcy, 1-> 1Tcy, 63->64 Tcy
	AD1CSSL = 0;							//scanning disabled
	//AD1PCFGLbits.PCFG15=1;					//1->band gap enabled, 0->band gap disabled
	AD1CON1bits.ADON = 1;					//1->enable adc
}

//read the adc
//single ended only.
uint16_t analogRead(uint16_t adc_ch) {
	uint16_t tmp;

	tmp=AD1PCFGL;							//save current port configuration setting
	//set up adc port configuration bits
	//for the positive channel (mux a only)
	AD1CON1bits.DONE=0;
	adc_ch = adc_ch & 0x0f;					//adc_ch limited to 16 channels
#if 1
	AD1PCFGL &=~(1<<adc_ch);				//configure the port to be analog
	AD1CHS0 = adc_ch;						//select the channel
#else
	switch (adc_ch) {
	case ADC_AN0:
		AD1PCFGL &=~(1<< 0); AD1CHS0=0x0000; break;		//AD1PCFG: 1->digital GPIO, 0->analog input
	case ADC_AN1:
		AD1PCFGL &=~(1<< 1); AD1CHS0=0x0001; break;
	case ADC_AN2:
		AD1PCFGL &=~(1<< 2); AD1CHS0=0x0002; break;
	case ADC_AN3:
		AD1PCFGL &=~(1<< 3); AD1CHS0=0x0003; break;
	case ADC_AN4:
		AD1PCFGL &=~(1<< 4); AD1CHS0=0x0004; break;
	case ADC_AN5:
		AD1PCFGL &=~(1<< 5); AD1CHS0=0x0005; break;
	case ADC_AN6:
		AD1PCFGL &=~(1<< 6); AD1CHS0=0x0006; break;									//not implemented on 28pin devices. do not use
	case ADC_AN7:
		AD1PCFGL &=~(1<< 7); AD1CHS0=0x0007; break;									//not implemented on 28pin devices. do not use
	case ADC_AN8:
		AD1PCFGL &=~(1<< 8); AD1CHS0=0x0008; break;									//not implemented on 28pin devices. do not use
	case ADC_AN9:
		AD1PCFGL &=~(1<< 9); AD1CHS0=0x0008; break;
	case ADC_AN10:
		AD1PCFGL &=~(1<<10); AD1CHS0=0x000a; break;
	case ADC_AN11:
		AD1PCFGL &=~(1<<11); AD1CHS0=0x000b; break;
	case ADC_AN12:
		AD1PCFGL &=~(1<<12); AD1CHS0=0x000c; break;									//not impelemned on 28pin devices. do not use
	case ADC_VCORE:
		AD1PCFGL &=~(1<<13); AD1CHS0=0x000d; break;
	case ADC_VBG_2:
		AD1PCFGL &=~(1<<14); AD1CHS0=0x000e; break;
	case ADC_VBG:
		AD1PCFGL &=~(1<<15); AD1CHS0=0x000f; break;									//AD1PCFG = ~adc_ch;					//mux b: not used; mux a: negative is Vref-,
	//case ADC_CTMU:		AD1PCFG &=~(0<<0); AD1CHS = 0x001f; break;						//reserved for ctmu
	default:
		break;									//do nothing
	}
#endif
	AD1CON1bits.SAMP = 1;						//start the adc
	//insert delays if necessary
	delayTks(ADC_DLY);
	while (!AD1CON1bits.DONE) continue;		//wait for adc to finish
	AD1PCFGL = tmp;								//restore ad1pcfg setting
	return ADC1BUF0;							//return the adc results
}
//end ADC

//arand
//analog random
//generate 4-bit random numbers
uint8_t arand4(void) {
	uint8_t tmp=arand1();

	//tmp = (tmp << 1) | arand1();
	tmp = (tmp << 1) | arand1();
	tmp = (tmp << 1) | arand1();
	tmp = (tmp << 1) | arand1();
	return tmp;
}

//generate 8-bit random number
uint8_t arand8(void) {
	return (arand4() << 4) | arand4();
}

//return 16-bit random number
uint16_t arand16(void) {
	return ((uint16_t) arand8() << 8) | arand8();
}


//return 32-bit random number
uint32_t arand32(void) {
	return ((uint32_t) arand16() << 16) | arand16();
}
//end analog random
//end arand

//output compare
//oc1
uint16_t _oc1pr=0xffff;							//oc isr period
void (*_oc1_isrptr)(void)=empty_handler;		//tmr1_ptr pointing to empty_handler by default
//OC ISR
void _ISR_PSV _OC1Interrupt(void) {			//for PIC24
	//clear the flag
	IFS0bits.OC1IF = 0;							//clear the flag
	OC1RS += _oc1pr;							//update to the next match point
	_oc1_isrptr();								//run user handler
}

void oc1Init(uint16_t pr) {
	_oc1_isrptr=empty_handler;
	_oc1pr = pr;								//reset the pr

	//power up the pwm module
	PMD2bits.OC1MD = 0;							//0->turn on the peripheral, 1->turn off the peripheral

	//assign the output pins
#if defined(PWM12RP)
	PWM12RP();
#endif

	//tris pin presumed to have been set to output

	//for ga002 devices
	//OCxCON1 register settings
	//reset the registers
	OC1CON = 0x0000;
	//OC5CON2 = 0x0000;
	OC1CONbits.OCM = 0x03;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled, 0b011->compare toggles ocx
	OC1CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
	//OC1R = OC1RS = TMR2 + _oc1pr;			//reset the duty cycle registers

