dannyf00/Ghetto-GPSDO/v0.6c/dspic33duino.c
	IFS0bits.OC1IF = 0;						//0->clear the flag;
	IEC0bits.OC1IE = 0;						//0->disable the interrupt, 1->enable the interrupt
	IPC0bits.OC1IP = OCxIP_DEFAULT;			//clear the interrupt priority

	//OC1CON1bits.ON= 1;						//1->turn on oc, 0->turn off oc

}

//activate user isr
void oc1AttachISR(void (*isrptr)(void)) {
	_oc1_isrptr=isrptr;						//activate the isr handler
	OC1RS = TMR2 + _oc1pr;					//update to the next match point
	IFS0bits.OC1IF = 0;						//0->clear the flag;
	IEC0bits.OC1IE = 1;						//0->disable the interrupt, 1->enable the interrupt
}

//oc2
uint16_t _oc2pr=0xffff;							//oc isr period
void (*_oc2_isrptr)(void)=empty_handler;		//tmr1_ptr pointing to empty_handler by default
//OC ISR
void _ISR_PSV _OC2Interrupt(void) {			//for PIC24
	//clear the flag
	IFS0bits.OC2IF = 0;							//clear the flag
	OC2RS += _oc2pr;							//update to the next match point
	_oc2_isrptr();								//run user handler
}

void oc2Init(uint16_t pr) {
	_oc2_isrptr=empty_handler;
	_oc2pr = pr;								//reset the pr

	//power up the pwm module
	PMD2bits.OC2MD = 0;							//0->turn on the peripheral, 1->turn off the peripheral

	//assign the output pins
#if defined(PWM22RP)
	PWM22RP();
#endif

	//tris pin presumed to have been set to output

	//for ga002 devices
	//OCxCON1 register settings
	//reset the registers
	OC2CON = 0x0000;
	//OC5CON2 = 0x0000;
	OC2CONbits.OCM = 0x03;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled, 0b011->compare toggles ocx
	OC2CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
	//OC2R = OC2RS = TMR2 + _oc2pr;			//reset the duty cycle registers

	IFS0bits.OC2IF = 0;						//0->clear the flag;
	IEC0bits.OC2IE = 0;						//0->disable the interrupt, 1->enable the interrupt
	IPC1bits.OC2IP = OCxIP_DEFAULT;			//clear the interrupt priority

	//OC2CON1bits.ON= 1;						//1->turn on oc, 0->turn off oc

}

//activate user isr
void oc2AttachISR(void (*isrptr)(void)) {
	_oc2_isrptr=isrptr;						//activate the isr handler
	OC2RS = TMR2 + _oc2pr;					//update to the next match point
	IFS0bits.OC2IF = 0;						//0->clear the flag;
	IEC0bits.OC2IE = 1;						//0->disable the interrupt, 1->enable the interrupt
}

//oc3
uint16_t _oc3pr=0xffff;							//oc isr period
void (*_oc3_isrptr)(void)=empty_handler;		//tmr1_ptr pointing to empty_handler by default
//OC ISR
void _ISR_PSV _OC3Interrupt(void) {			//for PIC24
	//clear the flag
	IFS1bits.OC3IF = 0;							//clear the flag
	OC3RS += _oc3pr;							//update to the next match point
	_oc3_isrptr();								//run user handler
}

void oc3Init(uint16_t pr) {
	_oc3_isrptr=empty_handler;
	_oc3pr = pr;								//reset the pr

	//power up the pwm module
	PMD2bits.OC3MD = 0;							//0->turn on the peripheral, 1->turn off the peripheral

	//assign the output pins
#if defined(PWM32RP)
	PWM32RP();
#endif

	//tris pin presumed to have been set to output

	//for ga002 devices
	//OCxCON1 register settings
	//reset the registers
	OC3CON = 0x0000;
	//OC3CON2 = 0x0000;
	OC3CONbits.OCM = 0x03;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled, 0b011->compare toggles ocx
	OC3CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
	//OC3R = OC3RS = TMR2 + _oc3pr;			//reset the duty cycle registers

	IFS1bits.OC3IF = 0;						//0->clear the flag;
	IEC1bits.OC3IE = 0;						//0->disable the interrupt, 1->enable the interrupt
	IPC6bits.OC3IP = OCxIP_DEFAULT;			//clear the interrupt priority

	//OC3CON1bits.ON= 1;						//1->turn on oc, 0->turn off oc

}

//activate user isr
void oc3AttachISR(void (*isrptr)(void)) {
	_oc3_isrptr=isrptr;						//activate the isr handler
	OC3RS = TMR2 + _oc3pr;					//update to the next match point
	IFS1bits.OC3IF = 0;						//0->clear the flag;
	IEC1bits.OC3IE = 1;						//0->disable the interrupt, 1->enable the interrupt
}

//oc4
uint16_t _oc4pr=0xffff;							//oc isr period
void (*_oc4_isrptr)(void)=empty_handler;		//tmr1_ptr pointing to empty_handler by default
//OC ISR
void _ISR_PSV _OC4Interrupt(void) {			//for PIC24
	//clear the flag
	IFS1bits.OC4IF = 0;							//clear the flag
	OC4RS += _oc4pr;							//update to the next match point
	_oc4_isrptr();								//run user handler
}

void oc4Init(uint16_t pr) {
	_oc4_isrptr=empty_handler;
	_oc4pr = pr;								//reset the pr

	//power up the pwm module
	PMD2bits.OC4MD = 0;							//0->turn on the peripheral, 1->turn off the peripheral

	//assign the output pins
#if defined(PWM42RP)
	PWM42RP();
#endif

	//tris pin presumed to have been set to output

	//for ga002 devices
	//OCxCON1 register settings
	//reset the registers
	OC4CON = 0x0000;
	//OC4CON2 = 0x0000;
	OC4CONbits.OCM = 0x03;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled, 0b011->compare toggles ocx
	OC4CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
	//OC4R = OC4RS = TMR2 + _oc4pr;			//reset the duty cycle registers

	IFS1bits.OC4IF = 0;						//0->clear the flag;
	IEC1bits.OC4IE = 0;						//0->disable the interrupt, 1->enable the interrupt
	IPC6bits.OC4IP = OCxIP_DEFAULT;			//clear the interrupt priority

	//OC1CON1bits.ON= 1;						//1->turn on oc, 0->turn off oc

}

//activate user isr
void oc4AttachISR(void (*isrptr)(void)) {
	_oc4_isrptr=isrptr;						//activate the isr handler
	OC4RS = TMR2 + _oc4pr;					//update to the next match point
	IFS1bits.OC4IF = 0;						//0->clear the flag;
	IEC1bits.OC4IE = 1;						//0->disable the interrupt, 1->enable the interrupt
}

//oc5
#if 0	//not avalable on target chip
uint16_t _oc5pr=0xffff;							//oc isr period
void (*_oc5_isrptr)(void)=empty_handler;		//tmr1_ptr pointing to empty_handler by default
//OC ISR
void _ISR_PSV _OC5Interrupt(void) {			//for PIC24
	//clear the flag
	IFS1bits.OC5IF = 0;							//clear the flag
	OC5RS += _oc5pr;							//update to the next match point
	_oc5_isrptr();								//run user handler
}

void oc5Init(uint16_t pr) {
	_oc5_isrptr=empty_handler;
	_oc5pr = pr;								//reset the pr

