dannyf00/Ghetto-GPSDO/v0.6c/dspic33duino.c
	//for ga002 devices
	IC3CON = 0;							//reset to default value
	//IC2CON2 = 0;						//reset to default value
	IC3CON  = 	(0<<15) |				//1->enable the module, 0->disable the module
				(0<<13) |				//0->operates in idle, 1->don't operate in idle
				(1<<9) |				//1-.capture rising edge first (only used for ICM110)
				(0<<8) |				//1->32-bit mode, 0->16-bit mode
				(1<<7) |				//1->timer2 as timebase, 0->timer3 as timebase
				(0<<5) |				//0->interrupt on every capture event, 1->on every second capture event, 2->on every 3rd event, 3->on every 4th event
				(0<<4) |				//0->ICx no overflow, 1->ICx overflow
				(0<<3) |				//0->buffer is empty, 1->buffer is not empty
				(3<<0) |				//0->ICx disabled, 1->every edge, 2->every falling edge, 3->every rising edge, ...
				0x00;

	while (IC3CONbits.ICBNE) IC3BUF;	//read the buffer to clear the flag
	IFS0bits.IC3IF   = 0;				//0->clear the flag
	IEC0bits.IC3IE   = 0;				//1->enable the interrupt, 0->disable the interrupt
	//ICxIP   = 1;						//optional
	//enable the input capture
	//IC2CONbits.ON = 1;				//1->enable the module, 0->disable the module

#if defined(IC32RP)
	IC32RP();							//assign pin to IC
#endif
}

//activate user ptr
void ic3AttachISR(void (*isrptr)(void)) {
	_ic3_isrptr = isrptr;				//install user ptr
	//IC2BUF;								//read the buffer to clear the flag
	IFS0bits.IC3IF   = 0;				//0->clear the flag
	IEC0bits.IC3IE   = 1;				//1->enable the interrupt, 0->disable the interrupt
}

//ic4
static void (*_ic4_isrptr)(void)=empty_handler;				//function pointer pointing to empty_handler by default
//volatile uint16_t IC2DAT=0;				//buffer

//input capture ISR
void _ISR_PSV _IC4Interrupt(void) {		//for PIC24
	//clear the flag
	//IC2DAT = IC2BUF;					//read the captured value
	IFS0bits.IC4IF = 0;					//clear the flag after the buffer has been read (the interrupt flag is persistent)
	_ic4_isrptr();						//run user handler
}

//reset input capture 1
//16-bit mode, rising edge, single capture, Timer2 as timebase
//interrupt disabled
void ic4Init(void) {
	_ic4_isrptr = empty_handler;		//reset user handler

	PMD2bits.IC4MD = 0;					//0->enable power to input capture

	//for ga002 devices
	IC4CON = 0;							//reset to default value
	//IC2CON2 = 0;						//reset to default value
	IC4CON  = 	(0<<15) |				//1->enable the module, 0->disable the module
				(0<<13) |				//0->operates in idle, 1->don't operate in idle
				(1<<9) |				//1-.capture rising edge first (only used for ICM110)
				(0<<8) |				//1->32-bit mode, 0->16-bit mode
				(1<<7) |				//1->timer2 as timebase, 0->timer3 as timebase
				(0<<5) |				//0->interrupt on every capture event, 1->on every second capture event, 2->on every 3rd event, 3->on every 4th event
				(0<<4) |				//0->ICx no overflow, 1->ICx overflow
				(0<<3) |				//0->buffer is empty, 1->buffer is not empty
				(3<<0) |				//0->ICx disabled, 1->every edge, 2->every falling edge, 3->every rising edge, ...
				0x00;

	while (IC4CONbits.ICBNE) IC4BUF;	//read the buffer to clear the flag
	IFS0bits.IC4IF   = 0;				//0->clear the flag
	IEC0bits.IC4IE   = 0;				//1->enable the interrupt, 0->disable the interrupt
	//ICxIP   = 1;						//optional
	//enable the input capture
	//IC2CONbits.ON = 1;				//1->enable the module, 0->disable the module

#if defined(IC42RP)
	IC42RP();							//assign pin to IC
#endif
}

//activate user ptr
void ic4AttachISR(void (*isrptr)(void)) {
	_ic4_isrptr = isrptr;				//install user ptr
	//IC2BUF;								//read the buffer to clear the flag
	IFS0bits.IC4IF   = 0;				//0->clear the flag
	IEC0bits.IC4IE   = 1;				//1->enable the interrupt, 0->disable the interrupt
}

//ic5
static void (*_ic5_isrptr)(void)=empty_handler;				//function pointer pointing to empty_handler by default
//volatile uint16_t IC2DAT=0;				//buffer

//input capture ISR
void _ISR_PSV _IC5Interrupt(void) {		//for PIC24
	//clear the flag
	//IC2DAT = IC2BUF;					//read the captured value
	IFS0bits.IC5IF = 0;					//clear the flag after the buffer has been read (the interrupt flag is persistent)
	_ic5_isrptr();						//run user handler
}

//reset input capture 1
//16-bit mode, rising edge, single capture, Timer2 as timebase
//interrupt disabled
void ic5Init(void) {
	_ic5_isrptr = empty_handler;		//reset user handler

	PMD2bits.IC5MD = 0;					//0->enable power to input capture

	//for ga002 devices
	IC5CON = 0;							//reset to default value
	//IC2CON2 = 0;						//reset to default value
	IC5CON  = 	(0<<15) |				//1->enable the module, 0->disable the module
				(0<<13) |				//0->operates in idle, 1->don't operate in idle
				(1<<9) |				//1-.capture rising edge first (only used for ICM110)
				(0<<8) |				//1->32-bit mode, 0->16-bit mode
				(1<<7) |				//1->timer2 as timebase, 0->timer3 as timebase
				(0<<5) |				//0->interrupt on every capture event, 1->on every second capture event, 2->on every 3rd event, 3->on every 4th event
				(0<<4) |				//0->ICx no overflow, 1->ICx overflow
				(0<<3) |				//0->buffer is empty, 1->buffer is not empty
				(3<<0) |				//0->ICx disabled, 1->every edge, 2->every falling edge, 3->every rising edge, ...
				0x00;

	while (IC5CONbits.ICBNE) IC5BUF;	//read the buffer to clear the flag
	IFS0bits.IC5IF   = 0;				//0->clear the flag
	IEC0bits.IC5IE   = 0;				//1->enable the interrupt, 0->disable the interrupt
	//ICxIP   = 1;						//optional
	//enable the input capture
	//IC2CONbits.ON = 1;				//1->enable the module, 0->disable the module

#if defined(IC52RP)
	IC52RP();							//assign pin to IC
#endif
}

//activate user ptr
void ic5AttachISR(void (*isrptr)(void)) {
	_ic5_isrptr = isrptr;				//install user ptr
	//IC2BUF;								//read the buffer to clear the flag
	IFS0bits.IC5IF   = 0;				//0->clear the flag
	IEC0bits.IC5IE   = 1;				//1->enable the interrupt, 0->disable the interrupt
}
#endif	//0

static void (*_ic7_isrptr)(void)=empty_handler;				//function pointer pointing to empty_handler by default
//volatile uint16_t IC7DAT=0;				//buffer

//input capture ISR
void _ISR_PSV _IC7Interrupt(void) {		//for PIC24
	//clear the flag
	//IC7DAT = IC7BUF;					//read the captured value
	IFS1bits.IC7IF = 0;					//clear the flag after the buffer has been read (the interrupt flag is persistent)
	_ic7_isrptr();						//run user handler
}

//reset input capture 1
//16-bit mode, rising edge, single capture, Timer2 as timebase
//interrupt disabled
void ic7Init(void) {
	_ic7_isrptr = empty_handler;		//reset user handler

