dannyf00/Ghetto-GPSDO/v0.6c/dspic33duino.c
	PMD2bits.IC7MD = 0;					//0->enable power to input capture

	//for ga002 devices
	IC7CON = 0;							//reset to default value
	//IC7CON2 = 0;						//reset to default value
	IC7CON  = 	(0<<15) |				//1->enable the module, 0->disable the module
				(0<<13) |				//0->operates in idle, 1->don't operate in idle
				(1<<9) |				//1-.capture rising edge first (only used for ICM110)
				(0<<8) |				//1->32-bit mode, 0->16-bit mode
				(1<<7) |				//1->timer2 as timebase, 0->timer3 as timebase
				(0<<5) |				//0->interrupt on every capture event, 1->on every second capture event, 2->on every 3rd event, 3->on every 4th event
				(0<<4) |				//0->ICx no overflow, 1->ICx overflow
				(0<<3) |				//0->buffer is empty, 1->buffer is not empty
				(3<<0) |				//0->ICx disabled, 1->every edge, 2->every falling edge, 3->every rising edge, ...
				0x00;

	while (IC7CONbits.ICBNE) IC7BUF;	//read the buffer to clear the flag
	IFS1bits.IC7IF   = 0;				//0->clear the flag
	IEC1bits.IC7IE   = 0;				//1->enable the interrupt, 0->disable the interrupt
	//ICxIP   = 1;						//optional
	//enable the input capture
	//IC7CONbits.ON = 1;				//1->enable the module, 0->disable the module

#if defined(IC72RP)
	IC72RP();							//assign pin to IC
#endif
}

//activate user ptr
void ic7AttachISR(void (*isrptr)(void)) {
	_ic7_isrptr = isrptr;				//install user ptr
	//IC7BUF;								//read the buffer to clear the flag
	IFS1bits.IC7IF   = 0;				//0->clear the flag
	IEC1bits.IC7IE   = 1;				//1->enable the interrupt, 0->disable the interrupt
}

static void (*_ic8_isrptr)(void)=empty_handler;				//function pointer pointing to empty_handler by default
//volatile uint16_t IC8DAT=0;				//buffer

//input capture ISR
void _ISR_PSV _IC8Interrupt(void) {		//for PIC24
	//clear the flag
	//IC8DAT = IC8BUF;					//read the captured value
	IFS1bits.IC8IF = 0;					//clear the flag after the buffer has been read (the interrupt flag is persistent)
	_ic8_isrptr();						//run user handler
}

//reset input capture 1
//16-bit mode, rising edge, single capture, Timer2 as timebase
//interrupt disabled
void ic8Init(void) {
	_ic8_isrptr = empty_handler;		//reset user handler

	PMD2bits.IC8MD = 0;					//0->enable power to input capture

	//for ga002 devices
	IC8CON = 0;							//reset to default value
	//IC8CON2 = 0;						//reset to default value
	IC8CON  = 	(0<<15) |				//1->enable the module, 0->disable the module
				(0<<13) |				//0->operates in idle, 1->don't operate in idle
				(1<<9) |				//1-.capture rising edge first (only used for ICM110)
				(0<<8) |				//1->32-bit mode, 0->16-bit mode
				(1<<7) |				//1->timer2 as timebase, 0->timer3 as timebase
				(0<<5) |				//0->interrupt on every capture event, 1->on every second capture event, 2->on every 3rd event, 3->on every 4th event
				(0<<4) |				//0->ICx no overflow, 1->ICx overflow
				(0<<3) |				//0->buffer is empty, 1->buffer is not empty
				(3<<0) |				//0->ICx disabled, 1->every edge, 2->every falling edge, 3->every rising edge, ...
				0x00;

	while (IC8CONbits.ICBNE) IC8BUF;	//read the buffer to clear the flag
	IFS1bits.IC8IF   = 0;				//0->clear the flag
	IEC1bits.IC8IE   = 0;				//1->enable the interrupt, 0->disable the interrupt
	//ICxIP   = 1;						//optional
	//enable the input capture
	//IC8CONbits.ON = 1;				//1->enable the module, 0->disable the module

#if defined(IC82RP)
	IC82RP();							//assign pin to IC
#endif
}

//activate user ptr
void ic8AttachISR(void (*isrptr)(void)) {
	_ic8_isrptr = isrptr;				//install user ptr
	//IC8BUF;								//read the buffer to clear the flag
	IFS1bits.IC8IF   = 0;				//0->clear the flag
	IEC1bits.IC8IE   = 1;				//1->enable the interrupt, 0->disable the interrupt
}

//end input capture

//extint
//extint0
void (* _int0_isrptr) (void)=empty_handler;

void _ISR_PSV _INT0Interrupt(void) {
	IFS0bits.INT0IF = 0;				//clera the flag
	_int0_isrptr();						//run the isr
}

void int0Init(void) {
	//INT02RP();						//map int0_pin - int0 cannot be remapped
	_int0_isrptr = empty_handler;		//initialize int isr ptr
	IFS0bits.INT0IF = 0;				//clear int0 flag
	IEC0bits.INT0IE = 0;				//1->enable int0 interrupt, 0->disable the interrupt
	//INTCONbits.INT0EP = 1;			//1=triggered on the falling edge. 0 = rising edge
}

void int0AttachISR(void (*isrptr) (void)) {
	_int0_isrptr = isrptr;
	IFS0bits.INT0IF = 0;				//clear int0 flag
	IEC0bits.INT0IE = 1;				//1->enable int0 interrupt, 0->disable the interrupt
}

//extint1
void (* _int1_isrptr) (void)=empty_handler;

void _ISR_PSV _INT1Interrupt(void) {
	IFS1bits.INT1IF = 0;				//clera the flag
	_int1_isrptr();						//run the isr
}

void int1Init(void) {
	INT12RP();							//map int1_pin
	_int1_isrptr = empty_handler;		//initialize int isr ptr
	IFS1bits.INT1IF = 0;				//clear int0 flag
	IEC1bits.INT1IE = 0;				//1->enable int0 interrupt, 0->disable the interrupt
	//INTCONbits.INT1EP = 1;			//1=triggered on the falling edge. 0 = rising edge
}

void int1AttachISR(void (*isrptr) (void)) {
	_int1_isrptr = isrptr;
	IFS1bits.INT1IF = 0;				//clear int0 flag
	IEC1bits.INT1IE = 1;				//1->enable int0 interrupt, 0->disable the interrupt
}

//extint2
void (* _int2_isrptr) (void)=empty_handler;

void _ISR_PSV _INT2Interrupt(void) {
	IFS1bits.INT2IF = 0;				//clera the flag
	_int2_isrptr();						//run the isr
}

void int2Init(void) {
	INT22RP();							//map int2_pin
	_int2_isrptr = empty_handler;		//initialize int isr ptr
	IFS1bits.INT2IF = 0;				//clear int0 flag
	IEC1bits.INT2IE = 0;				//1->enable int0 interrupt, 0->disable the interrupt
	//INTCONbits.INT2EP = 1;			//1=triggered on the falling edge. 0 = rising edge
}

void int2AttachISR(void (*isrptr) (void)) {
	_int2_isrptr = isrptr;
	IFS1bits.INT2IF = 0;				//clear int0 flag
	IEC1bits.INT2IE = 1;				//1->enable int0 interrupt, 0->disable the interrupt
}


//end extint

//spi
//rest spi1
void spi1Init(uint16_t br) {
	PMD1bits.SPI1MD = 0;				//0->enable the module

	//map the pins
#if defined(SCK1RP)
	SCK1RP();
#endif
#if defined(SDO1RP)
	SDO1RP();
#endif
#if defined(SDI1RP)
	SDI1RP();
#endif

	//initialize the spi module
	//master mode, PBCLK as clock, 8-bit data, enhanced buffer mode
	SPI1CON1 = SPI1CON2 = 0; 			//reset the spi module
	SPI1CON1bits.MSTEN = 1;				//1->master mode, 0->slave mode
	SPI1CON1bits.PPRE = br;				//set the baudrate generator (primary prescaler)
	SPI1CON1bits.SPRE = 0;				//set the secondary prescaler
	SPI1STATbits.SPIROV=0;				//clear rov flag
	//SPI1BUF;							//perform a read to clear the flag
	//SPI1CON2bits.SPIBEN= 1;				//1->enable enhanced buffer mode, 0->disable enhanced buffer mode
	//need to deal with secondary as well
	SPI1BUF;							//read the buffer to reset the flag
	IFS0bits.SPI1IF = 0;				//0->reset the flag
	IEC0bits.SPI1IE = 0;				//0->disable the interrupt, 1->enable the interrupt
	IPC2bits.SPI1IP = SPIIP_DEFAULT;	//default interrupt priority

