dannyf00/Ghetto-GPSDO/v0.6c/dspic33duino.c
	SPI1STATbits.SPIEN = 1;				//1->enable the module, 0->disable the module
}

//rest spi2
void spi2Init(uint16_t br) {
	PMD1bits.SPI2MD = 0;				//0->enable the module

	//map the pins
#if defined(SCK2RP)
	SCK2RP();
#endif
#if defined(SDO2RP)
	SDO2RP();
#endif
#if defined(SDI2RP)
	SDI2RP();
#endif


	//initialize the spi module
	//master mode, PBCLK as clock, 8-bit data, enhanced buffer mode
	SPI2CON1 = SPI2CON2 = 0; 			//reset the spi module
	SPI2CON1bits.MSTEN = 1;				//1->master mode, 0->slave mode
	SPI2CON1bits.PPRE = br;				//set the baudrate generator
	SPI2CON1bits.SPRE = 0;				//set the secondary prescaler
	SPI1STATbits.SPIROV=0;				//clear rov flag
	//SPI1BUF;							//perform a read to clear the flag
	//SPI1CON2bits.SPIBEN= 1;				//1->enable enhanced buffer mode, 0->disable enhanced buffer mode
	//need to deal with 2nd ary as well
	SPI2BUF;							//read the buffer to reset the flag
	IFS2bits.SPI2IF = 0;				//0->reset the flag
	IEC2bits.SPI2IE = 0;				//0->disable the interrupt, 1->enable the interrupt
	IPC8bits.SPI2IP = SPIIP_DEFAULT;	//default interrupt priority

	SPI2STATbits.SPIEN = 1;				//1->enable the module, 0->disable the module
}

//send data via spi
//void spi2Write(uint8_t dat) {
//	while (spi2Busy()) continue;		//tx buffer is full
//	SPI2BUF = dat;						//load the data
//}
//end spi

//i2c
//i2c1
//wait for i2c
#define i2c1Wait()		do {while (I2C1CON & 0x1f); while (I2C1STATbits.TRSTAT);} while (0)		//wait for i2c1

//#define F_I2C1			100000ul	//I2C frequency
//initialize the i2c
void I2C1Init(uint32_t bps) {
	PMD1bits.I2C1MD = 0;				//0->enable the module, 1->disable the module
	I2C1CON = 0;						//reset i2c
	I2C1BRG = F_PHB / 2 / bps - 1 - (F_PHB / 2 / 10000000ul);	//TPGOB = 130ns, minimum of 4
	if (I2C1BRG < 0x04) I2C1BRG = 0x04;	//values 0..3 prohibited
	I2C1CONbits.I2CEN = 1;					//1->turn on the i2c, 0->turn off the i2c
}

//send a start condition
void I2C1Start(void) {
	i2c1Wait();
	I2C1CONbits.SEN = 1;
	while (I2C1CONbits.SEN == 1) continue;
}

//send a stop condition
void I2C1Stop(void) {
	i2c1Wait();
	I2C1CONbits.PEN = 1;
	while (I2C1CONbits.PEN == 1) continue;
}

//send a restart condition
void I2C1Restart(void) {
	i2c1Wait();
	I2C1CONbits.RSEN = 1;
	while (I2C1CONbits.RSEN == 1) continue;
}

//send i2c
unsigned char I2C1Write(unsigned char dat) {
	I2C1TRN = dat; 					 			// Send slave address with Read/Write bit cleared
	//while (I2C1STATbits.TRSTAT == 1) continue;	// Wait until transmit buffer is empty
	while (I2C1STATbits.TBF == 1) continue;		// Wait until transmit buffer is empty
	//i2c1Wait();								//wait for i2c bus to idle
	while (I2C1STATbits.ACKSTAT == 1) continue;	//wait for the ack signal
	return I2C1STATbits.ACKSTAT; 				// Wait until ACK is received
}

//read i2c
unsigned char I2C1Read(unsigned char ack) {
	I2C1CONbits.RCEN = 1;			   		// Receive enable
	while (I2C1CONbits.RCEN == 1) continue;		// Wait until RCEN is cleared (automatic)
	I2C1STATbits.I2COV = 0;						//clear the flag
	I2C1CONbits.ACKDT = ack;					//send ack bits
	I2C1CONbits.ACKEN = 1;
	while (I2C1CONbits.ACKEN == 1) continue;
	return I2C1RCV;								// Retrieve value from I2C1RCV
}
//write from a buffer
uint8_t I2C1Writes(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t *pBuffer, uint16_t NumByteToWrite) {
	I2C1Start();							//send start condition
	I2C1Write(DeviceAddr | I2C_CMD_WRITE);	//send device addr, for write operations
	I2C1Write(RegAddr);					//send register addr
	while (NumByteToWrite) {
		I2C1Write(*pBuffer);				//send data
		pBuffer++;							//increment buffer pointer
		NumByteToWrite--;					//decrement counter
	}
	I2C1Stop();							//send stop condition
	return 0;								//indicating success
}

//read to a buffer
uint8_t I2C1Reads(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t *pBuffer, uint16_t NumByteToRead) {
	I2C1Start();							//send start condition
	I2C1Write(DeviceAddr | I2C_CMD_WRITE);	//send device addr, for write operations
	I2C1Write(RegAddr);					//send register addr
	I2C1Start();							//send restart
	I2C1Write(DeviceAddr | I2C_CMD_READ);	//send device addr, for read operations
	while (NumByteToRead) {
		if (NumByteToRead==1) {
			*pBuffer=I2C1Read(I2C_NOACK);
			I2C1Stop();							//send the stop condition
			break;
		}
		*pBuffer=I2C1Read(I2C_ACK);		//read the data
		pBuffer++;							//increment buffer
		NumByteToRead--;					//decrement count
	}
	return 0;
}

//end i2c1

//software i2c
#define sI2C_HIGH(pin)				do {						pinMode(pin, INPUT);  sI2C_DLY();} while (0)	//let pin float to high
#define sI2C_LOW(pin)				do {digitalWrite(pin, LOW); pinMode(pin, OUTPUT); sI2C_DLY();} while (0)	//pull pin low
#define sI2C_GET(pin)				digitalRead(pin)			//read a pin
#define sI2C_DLY()					delayTks(F_CPU / F_sI2C / 2)								//software I2C delay for half of the period to achieve F_sI2C

//initialize i2c
void sI2CInit(void) {
	//pins idle high / as input
	sI2C_HIGH(sI2CSDAPIN); sI2C_HIGH(sI2CSCLPIN);				//clear the bus (idles high)
}


//-----------------START Condition-----------------------
void sI2CStart(void) {
	sI2C_HIGH(sI2CSDAPIN);						//let sda high
	sI2C_HIGH(sI2CSCLPIN);						//let scl high
	sI2C_LOW(sI2CSDAPIN);						//pull i2c_sda low
	sI2C_LOW(sI2CSCLPIN);						//pull i2c_scl low
}

//------------------STOP Condition--------------------------
void sI2CStop(void) {
	sI2C_LOW(sI2CSCLPIN);						//let scl float high
	sI2C_LOW(sI2CSDAPIN);
	sI2C_HIGH(sI2CSCLPIN);						//let scl float high
	sI2C_HIGH(sI2CSDAPIN);						//let sda  high
}

//------------------restart condition---------------------

//-------------------I2C Write---------------------------
uint8_t sI2CWrite(uint8_t dat) {
	unsigned char i;

	sI2C_HIGH(sI2CSDAPIN);						//let sda float
	i=0x80;
	do {
		sI2C_LOW(sI2CSCLPIN);					//clear i2c_scl
	  	if(dat & i)
			{sI2C_HIGH(sI2CSDAPIN);}			//set i2c_sda
		else
			{sI2C_LOW(sI2CSDAPIN);}				//clear i2c_sda
		sI2C_HIGH(sI2CSCLPIN);					//set i2c_scl
	  	i = i >> 1;								//shift out the highest bit
	} while (i);
	sI2C_LOW(sI2CSCLPIN);						//clear i2c_scl

	sI2C_HIGH(sI2CSDAPIN);						//float sda, let the slave control it
	sI2C_HIGH(sI2CSCLPIN);
	i=0;
	while (sI2C_GET(sI2CSDAPIN)&&(i<I2C_ACK_ERROR))
		i++;									//wait for ack from the slave (ack = sda pulled to low by the slave
	sI2C_LOW(sI2CSCLPIN);
	if (i<I2C_ACK_ERROR) return I2C_ACK;		//no trouble
	else return I2C_NOACK;						//trouble! ack timed out
}

