dannyf00/Ghetto-GPSDO/v0.6c/dspic33duino.c
//-----------------------i2c read------------------------------
//to be consistent with i2c protocol, use negative logic
//ack = 0 -> send ack
//ack = 1 -> no ack
uint8_t sI2CRead(uint8_t ack) {
	unsigned char i, data_t=0;

	sI2C_HIGH(sI2CSDAPIN);						//let sda float
	i=0x80;
	do {
		sI2C_LOW(sI2CSCLPIN);					//clear i2c_scl
		data_t <<=1;							//left shift the data
		i = i >> 1;
		//i2c_delay(0); i2c_delay(0);i2c_delay(0);i2c_delay(0);
		sI2C_HIGH(sI2CSCLPIN);					//let scl float to high
		if (sI2C_GET(sI2CSDAPIN)) data_t |= 0x01;	//set the last bit high
		else data_t |= 0x00;
		//i2c_delay(0);
	} while (i);
	sI2C_LOW(sI2CSCLPIN);						//pull scl low
	if (ack==I2C_ACK)
		{sI2C_LOW(sI2CSDAPIN);}					//send ack
	else
		{sI2C_HIGH(sI2CSDAPIN);}				//send no-ack
	sI2C_HIGH(sI2CSCLPIN);						//send ack/no-ack
	sI2C_LOW(sI2CSCLPIN);
	return data_t;
}

//write from a buffer
uint8_t sI2CWrites(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t *pBuffer, uint16_t NumByteToWrite) {
	sI2CStart();							//send start condition
	sI2CWrite(DeviceAddr | I2C_CMD_WRITE);	//send device addr, for write operations
	sI2CWrite(RegAddr);					//send register addr
	while (NumByteToWrite) {
		sI2CWrite(*pBuffer);				//send data
		pBuffer++;							//increment buffer pointer
		NumByteToWrite--;					//decrement counter
	}
	sI2CStop();							//send stop condition
	return 0;								//indicating success
}

//read to a buffer
uint8_t sI2CReads(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t *pBuffer, uint16_t NumByteToRead) {
	sI2CStart();							//send start condition
	sI2CWrite(DeviceAddr | I2C_CMD_WRITE);	//send device addr, for write operations
	sI2CWrite(RegAddr);					//send register addr
	sI2CStart();							//send restart
	sI2CWrite(DeviceAddr | I2C_CMD_READ);	//send device addr, for read operations
	while (NumByteToRead) {
		if (NumByteToRead==1) {
			*pBuffer=sI2CRead(I2C_NOACK);
			sI2CStop();							//send the stop condition
			break;
		}
		*pBuffer=sI2CRead(I2C_ACK);		//read the data
		pBuffer++;							//increment buffer
		NumByteToRead--;					//decrement count
	}
	return 0;
}

//end software i2c

//rtcc

//global variables
static void (* _rtcc_isrptr)(void)=empty_handler;				//rtcc_ptr pointing to empty_handler by default

//interrupt service routine
void _ISR_PSV _RTCCInterrupt(void) {
	IFS3bits.RTCIF=0;							//clear interrupt flag
	_rtcc_isrptr();								//execute user tmr1 isr
}

//initialize the rtcc
//clock source choosen in config bits: RTCOSC (SOSC and LPRC)
void RTCInit(void) {
	PMD3bits.RTCCMD = 0;						//0->enable power to rtcc
	IFS3bits.RTCIF = 0;							//0->clear the flag
	IEC3bits.RTCIE = 0;							//0->disable the interrupt, 1->enable the interrupt
	//enable sosc
	di();
	__builtin_write_OSCCONL(OSCCON | (1<<1));	//1->enable sosc, 0->disable sosc
	ei();
	RTCC_WREN();								//allows write to rtc registers
	RCFGCALbits.RTCEN=1;						//start the rtc
	RTCC_WRDIS();
}

//read from rtcc
//mask: 0b00->min.sec, 0b01->weekday.hour, 0b10->month.day, 0b11->..year
uint16_t RTCRead(uint16_t mask) {
	//uint16_t tmp;
	//RTCC_WREN();								//allows write to rtc registers
	//RCFGCAL &= RTCC_MASK;						//mask off all bits not related to pointers
	//RCFGCAL |= mask;							//point to min/sec
	RCFGCALbits.RTCPTR=mask;
	//tmp = RTCVAL;								//return the lower byte
	//RTCC_WRDIS();
	return RTCVAL;
}

//write to rtcc
void RTCWrite(uint16_t mask, uint16_t byte_t) {
	RTCC_WREN();								//allows write to rtc registers
	//RCFGCAL &= RTCC_MASK;						//mask off all bits not related to pointers
	//RCFGCAL |= mask;							//point to min/sec
	RCFGCALbits.RTCPTR=mask;
	RTCVAL = byte_t;							//return the lower byte
	RTCC_WRDIS();
}

//write to rtcc calibration register
//-512 .. +508 RTC pulses every minute
//+/- 260ppm adjustment range, 2ppm/step
int8_t RTCSetCal(int8_t cal) {
	RTCC_WREN();								//allows write to rtc registers
	RCFGCALbits.CAL=cal;
	RTCC_WRDIS();
	return cal;
}

//read from rtcc calibration register
//uint8_t RTCGetCal(void) {
//	return RCFGCALbits.CAL;
//}

//attach rtc isr
void RTCAttachISR(void (*isrptr)(void)) {
	_rtcc_isrptr=isrptr;						//activate the isr handler
	IPC15bits.RTCIP = RTCIP_DEFAULT;
	//IPC0bits.T1IS = TxIS_DEFAULT;
	IFS3bits.RTCIF = 0;							//reset the flag
	IEC3bits.RTCIE = 1;							//rtc1 interrupt on
}

//convert rtcc to time_t
time_t RTC2time(time_t *t) {
	struct tm tm;
	uint16_t year, mondat, wkhour, minsec;
	uint8_t tmp;

	//read the rtcc
	RCFGCALbits.RTCPTR=3;			//start from reading year, decreaments after each read
	year  =RTCVAL;					//year since 1/1/2000
	mondat=RTCVAL;					//month (0..11) and date (1..31)
	wkhour=RTCVAL;					//weekday (0..6) and hour (0..23)
	minsec=RTCVAL;					//minute (0..59) and second (0..59)

	tmp = minsec;	tm.tm_sec = BCD2DEC(tmp);
	tmp = minsec>>8;tm.tm_min = BCD2DEC(tmp);
	tmp = wkhour;	tm.tm_hour= BCD2DEC(tmp);
	tmp = mondat; 	tm.tm_mday= BCD2DEC(tmp);
	tmp = mondat>>8;tm.tm_mon = BCD2DEC(tmp)-1;			//month = 0..11
	tmp = year;     tm.tm_year= BCD2DEC(tmp)+2000-1900;	//dspic33 RTCC starts at 1/1/2000, posix year relative to 1/1/1900
	if (t==NULL) return mktime(&tm); 						//just return seconds since epoch time if pointer is NULL
	return *t=mktime(&tm);									//change pointed value + return seconds since epoch time
}

//turn time (=time_t) to RTCC
time_t time2RTC(time_t t) {
	struct tm *tmptr;
	uint16_t year, mondat, wkhour, minsec;
	//uint8_t tmp;

	t=(t<946684800ul)?946684800ul:t;					//minimum time is 1/1/2000 for the hardware rtc
	tmptr=gmtime(&t);
	minsec = (DEC2BCD(tmptr->tm_min) << 8) | DEC2BCD(tmptr->tm_sec);
	wkhour =                                 DEC2BCD(tmptr->tm_hour);
	mondat = (DEC2BCD(tmptr->tm_mon+1)<<8) | DEC2BCD(tmptr->tm_mday);
	year   =                                 DEC2BCD(tmptr->tm_year+1900-2000);	//posix starts at 1/1/1900 and dspic33 RTCC starts at 1/1/2000
	//set rtcc
	RTCC_WREN();							//enable write to rtcc
	//write to the rtcc
	RCFGCALbits.RTCPTR=3;					//start from reading year, decreaments after each read
	RTCVAL = year;							//year since 1/1/2000
	RTCVAL = mondat;						//month (0..11) and date(1..31)
	RTCVAL = wkhour;						//weekday (0..6) and hour (0..23)
	RTCVAL = minsec;						//minute (0..59) and second (0..59)
	RTCC_WRDIS();							//disable write to rtcc
	return t;
}

//end rtcc

//software rtc
volatile sRTC_TypeDef sRTC={-1, 0, 0, 0};		//software RTC

//initialize software counter
void sRTCInit(void) {					//calibration from -128ppm to +128ppm, if sRTC_RATE = 1M
	//sRTC.tick_rate=sRTC_RATE;
	sRTC.time=-1;						//reset counter: -1=uninitiated timer
	sRTC.tick=0;						//reset the tick counter
	sRTC.cal=0;							//initialize calibration
	sRTC.halfsec=0;						//0->1st half sec, 1->2nd half sec
}

//initialize the calibration
void sRTCSetCal(int16_t cal) {
	sRTC.cal=cal;						//not implemented
}

//increment sRTC time - called sRTC_CALLRATE per second
void sRTCISR(void) {
	uint32_t tks=ticks();				//timestamp
	if (tks - sRTC.tick >= F_CPU) {	//if enough time has passed
		sRTC.tick += F_CPU;				//update tick
		sRTC.time += 1;					//advance time
	}
	sRTC.halfsec=(tks - sRTC.tick < F_CPU / 2)?0:1;	//half sec
}

//read sRTC second counter
time_t sRTC2time(time_t *t) {
	if (t==NULL) return sRTC.time;
	return *t=sRTC.time;
}

