dannyf00/Ghetto-GPSDO/v0.6c/dspic33duino.c
//set sRTC second counter - used for initialization
//returns -1 if uninitialized
time_t time2sRTC(time_t t) {
	return sRTC.time=t;
}

//read rtc tick
uint32_t sRTCTick(void) {
	return sRTC.tick;
}

//return half sec
//0: first half of a sec
//1: 2nd half of a sec
uint8_t sRTCHalfsec(void) {
	return sRTC.halfsec;
}

//end software rtc
//cnint
void (* _cn_isrptr) (void)=empty_handler;

void _ISR_PSV _CNInterrupt(void) {
	IFS1bits.CNIF = 0; 							//clear the flag
	_cn_isrptr();								//run the isr
}

//initialize change notification
void cnInit(uint32_t pins) {
	_cn_isrptr=empty_handler;					//reset the isr

	//enable power - always enabled

	IFS1bits.CNIF = 0;							//clear the flag
	IEC1bits.CNIE = 1;							//1->enable the interrupt, 0->disable the interrupt

	//set up cnie
	CNEN1 = pins;
	CNPU1 = pins;
	pins = pins >> 16;
	CNEN2 = pins;
	CNPU1 = pins;

	IEC1bits.CNIE = 1;							//1->enable the interrupt, 0->disable the interrupt
}

//attach user isr
void cnAttachISR(void (*isrptr) (void)) {
	_cn_isrptr = isrptr;						//point the isrptr
	IFS1bits.CNIF= 0;							//0->clear the flag
	IEC1bits.CNIE= 1;							//0->disable the interrupt
}

//end cnint

//crc, 16-bit and 32-bit
//initialize crc engine: little endian, no interrupt
//weight in xor, and initial value in init
void CRCInit(uint8_t len, uint32_t poly) {
#if defined(__PIC24GA10x__) | defined(__PIC24GB00x__)
	/*#if 	defined(__PIC24FJ64GA102__) | defined (__PIC24FJ64GA104__) | \
			defined(__PIC24FJ32GA102__) | defined (__PIC24FJ32GA104__) | \
			defined(__PIC24FJ64GB002__) | defined(__PIC24FJ64GB004__) | \
			defined(__PIC24FJ48GB002__) | defined(__PIC24FJ48GB004__) | \
			defined(__PIC24FJ32GB002__) | defined(__PIC24FJ32GB004__)*/
	PMD3bits.CRCMD = 0;							//0->enable the model, 1->disable the model

	//configure the crc engine
	CRCCON1 = CRCCON2 = 0;						//reset the configuration word
	CRCCON1bits.LENDIAN=0;						//0->data shifting LSB first (little endian), 1->data shifting MSB first (big endian)
	CRCCON1bits.CRCISEL=0;						//0->CRCIF set on shift completion; 1->CRCIF set on buffer empty
	//CRCCON1bits.CRCGO  =1;					//1->start crc shift, 0->crc shifter turned off

	CRCCON2bits.PLEN = len-1;	//0..31: length of CRC. 0x07->8bit, 0x0f->16 bit, 0x1f->32 bit
	CRCCON2bits.DWIDTH = CRCCON2bits.PLEN;		//set data width to plen

	//CRCXORH = CRCXORL = 0;					//crc xor registers
	//CRCXORH = xor >> 16; CRCXORL = xor;		//configure the xor words
	CRCXOR = poly;

	//CRCWDATH= init >> 16; CRCWDATL = init;
	//CRCWDAT = init;

	IFS4bits.CRCIF = 0;							//0->clear the flag, 1->set the flag
	IPC16bits.CRCIP= CRCIP_DEFAULT;				//set the interrupt priority
	//IPC16bits.CRCIS= CRCIS_DEFAULT;			//set the interrupt subpriority
	IEC4bits.CRCIE = 0;							//0->disable the interrupt, 1->enable the interrupt

	CRCCON1bits.CRCEN = 1;						//1->enable the model, 0->disable the model
#else	//ga00x chips
#if defined(__PIC24GA00x__)
	PMD3bits.CRCPMD = 0;							//0->enable the model, 1->disable the model
#else	//ga11x
	PMD3bits.CRCMD = 0;							//0->enable the model, 1->disable the model
#endif
	//configure the crc engine
	CRCCON = 0;									//reset the configuration word
	//CRCCONbits.LENDIAN=0;						//0->data shifting LSB first (little endian), 1->data shifting MSB first (big endian)
	//CRCCONbits.CRCISEL=0;						//0->CRCIF set on shift completion; 1->CRCIF set on buffer empty
	//CRCCON1bits.CRCGO  =1;					//1->start crc shift, 0->crc shifter turned off

	CRCCONbits.PLEN = len-1;	//0..31: length of CRC. 0x07->8bit, 0x0f->16 bit, 0x1f->32 bit
	//CRCCONbits.DWIDTH = CRCCON2bits.PLEN;		//set data width to plen

	//CRCXORH = CRCXORL = 0;					//crc xor registers
	//CRCXORH = xor >> 16; CRCXORL = xor;		//configure the xor words
	CRCXOR = poly;

	//CRCWDATH= init >> 16; CRCWDATL = init;
	//CRCWDAT = init;

	IFS4bits.CRCIF = 0;							//0->clear the flag, 1->set the flag
	IPC16bits.CRCIP= CRCIP_DEFAULT;				//set the interrupt priority
	//IPC16bits.CRCIS= CRCIS_DEFAULT;			//set the interrupt subpriority
	IEC4bits.CRCIE = 0;							//0->disable the interrupt, 1->enable the interrupt

	//CRCCONbits.CRCEN = 1;						//1->enable the model, 0->disable the model
#endif	//ga102
}

//calculate crc
//length must be multiples of 2
uint16_t CRC16(char *msg, uint16_t length, uint16_t init_val) {
	uint16_t tmp;
#if defined(__PIC24GA10x__)
	/*#if 	defined(__PIC24FJ64GA102__) | defined (__PIC24FJ64GA104__) | \
			defined(__PIC24FJ32GA102__) | defined (__PIC24FJ32GA104__)*/
	CRCWDAT = init_val;							//load the initial word
	CRCCON1bits.CRCGO = 1;						//CRCGo(); //while (CRCCON1bits.CRCMPT==0) continue;	//wait for crc to complete

	while (length) {
		//tmp = *(uint16_t *)msg++;				//load the data
		//tmp = ((uint16_t) (*msg++) << 8) | (*msg++);
		tmp = *msg++;
		tmp = tmp << 8;			//form the data
		tmp|= *msg++;
		while (CRCCON1bits.CRCFUL==1) continue;	//wait for buffer to have at least 1 space
		CRCDAT = tmp;
		length-=2;
	}

	while (CRCCON1bits.CRCFUL==1) continue;		//wait until CRC is not full
	CRCDAT = 0;									//shift out the last two bytes
	while (CRCCON1bits.CRCMPT==0) continue;
	NOP4();										//wait for the shift to complete. 1 NOP() is enough
	//CRCCON1bits.CRCGO=0;						//why?
	//while (CRCCON1bits.CRCGO == 1) continue;

#else
	CRCWDAT = init_val;							//load the initial word
	CRCCONbits.CRCGO = 1;						//CRCGo(); //while (CRCCON1bits.CRCMPT==0) continue;	//wait for crc to complete

	while (length) {
		//tmp = *(uint16_t *)msg++;				//load the data
		//tmp = ((uint16_t) (*msg++) << 8) | (*msg++);
		tmp = *msg++;
		tmp = tmp << 8;			//form the data
		tmp|= *msg++;
		while (CRCCONbits.CRCFUL==1) continue;	//wait for buffer to have at least 1 space
		CRCDAT = tmp;
		length-=2;
	}

	while (CRCCONbits.CRCFUL==1) continue;		//wait until CRC is not full
	CRCDAT = 0;									//shift out the last two bytes
	while (CRCCONbits.CRCMPT==0) continue;
	NOP4();										//wait for the shift to complete. 1 NOP() is enough
	//CRCCON1bits.CRCGO=0;						//why?
	//while (CRCCON1bits.CRCGO == 1) continue;

#endif

	return CRCWDAT;
}

