dannyf00/Ghetto-GPSDO/v0.6c/dspic33duino.c
//comparator voltage reference
void CVrefInit(void) {
	//no PMD bits?

	CVRCON = 0;									//reset value
	CVRCONbits.CVRR = 1;						//1->0..0.625 in 24 steps. 0->0.25..0.719 in 32 steps
	//output disabled
	//
	CVRCONbits.CVREN = 1;						//enable the module
}
//end comparator voltage reference

//comparator
#if defined(__PIC24GA10x__) | defined(__PIC24GB00x__) | defined(__PIC24GA11x__) | defined(__PIC24GB11x__)
/*#if 	defined(__PIC24FJ64GA102__) | defined(__PIC24FJ64GA104__) | \
		defined(__PIC24FJ32GA102__) | defined(__PIC24FJ32GA104__) | \
	 	defined(__PIC24FJ64GB002__) | defined(__PIC24FJ64GB004__) | \
		defined(__PIC24FJ48GB002__) | defined(__PIC24FJ48GB004__) | \
		defined(__PIC24FJ32GB002__) | defined(__PIC24FJ32GB004__)*/
//initialize comparator
void CM1Init(void) {
	PMD3bits.CMPMD = 0;							//1->disable the module, 0->enable the model

	CM1CON = 0;									//reset value
	CM1CONbits.CEN = 1;							//1->enable the module, 0->disable the module
}

void CM2Init(void) {
	PMD3bits.CMPMD = 0;							//1->disable the module, 0->enable the model

	CM2CON = 0;									//reset value
	CM2CONbits.CEN = 1;							//1->enable the module, 0->disable the module
}

void CM3Init(void) {
	PMD3bits.CMPMD = 0;							//1->disable the module, 0->enable the model

	CM3CON = 0;									//reset value
	CM3CONbits.CEN = 1;							//1->enable the module, 0->disable the module
}
#else		//ga002 devices
//initialize comparator
void CM1Init(void) {
	PMD3bits.CMPMD = 0;							//1->disable the module, 0->enable the model

	CMCON = CMCON & 0b0010101010101100;			//reset value
	CMCONbits.C1EN = 1;							//1->enable the module, 0->disable the module
}

void CM2Init(void) {
	PMD3bits.CMPMD = 0;							//1->disable the module, 0->enable the model

	CMCON = CMCON &~0b0010101010101100;			//reset value
	CMCONbits.C2EN = 1;							//1->enable the module, 0->disable the module
}
#endif

//end comparator

//circular buffer
//global defines
#define cBUFF_SIZE_MASK 	(cBUFF_SIZE-1U)		//mask

//global variables
//reset the cbuffer
void cbInit(CB_TypeDef *cbuffer) {
	cbuffer->writeIndex = cbuffer->readIndex = -1;
}

//returns true if cbuffer is empty
char cbEmpty(CB_TypeDef *cbuffer) {
	return (cbuffer->writeIndex & cBUFF_SIZE_MASK) == (cbuffer->readIndex & cBUFF_SIZE_MASK);
}

//returns true if cbuffer is full;
char cbFull(CB_TypeDef *cbuffer) {
	return ((cbuffer->writeIndex + 1) & cBUFF_SIZE_MASK) == (cbuffer->readIndex & cBUFF_SIZE_MASK);
}

//write to the buffer - needs to test if the buffer is full before writing to it
cbuffer_t cbWrite(CB_TypeDef *cbuffer, cbuffer_t dat) {
	cbuffer->buffer[(++cbuffer->writeIndex) & cBUFF_SIZE_MASK] = dat;
	return dat;
}

//read from the buffer - needs to test if the buffer is empty before reading from it
cbuffer_t cbRead(CB_TypeDef *cbuffer) {
	return cbuffer->buffer[(++cbuffer->readIndex) & cBUFF_SIZE_MASK];
}

//write string to CB
void str2cb(CB_TypeDef *cb, char *str) {
	while (!cbFull(cb) && (*str)) cbWrite(cb, *str++);
}

//write CB to string
void cb2str(char *str, CB_TypeDef *cb) {
	while (!cbEmpty(cb)) *str++=cbRead(cb);
}

//end circular buffer


#if 	defined(__dsPIC33FJ128GP804__) | defined (__dsPIC33FJ128GP802__) | defined(__dsPIC33FJ64GP804__)  | defined (__dsPIC33FJ64GP802__)
//dac1
//initialize dac1
//dac1xM output disabled
//input data = unsigned format
//len=0: disable left channel, 1: enable left channel
//ren=0: disable right channel,1: enable right channel
void dac1Init(char len, char ren) {
	PMD3bits.DAC1MD = 0;					//0->enable peripheral, 1->disable peripheral

	//configure dac1
	DAC1CON = 	(0<<15) |					//1->enable dac, 0->disable dac
				(0<<13) |					//0->enable dac in idle, 1->disable dac in idle
				(0<<12) |					//0->disable amp in sleep / idle, 1->enable amp in sleep / idle
				(0<< 8) |					//0->unsigned data, 1->signed data
				(6<< 0) |					//DAC clock divider. 0..127 (6=default)
				0x00;
	DAC1STAT=	(0<<15) |					//1->enable left channel output, 0->disable left channel output
				(0<<13) |					//1->enable left channel mid point output, 0->disable it
				(0<<10) |					//1->interrupt if left channel fifo is empty, 0->interrupt if left channel fifo is not full
				(0<< 7) |					//1->enable right channel output, 0->disable right channel output
				(0<< 5) |					//1->enable right channel mid point output, 0->disable it
				(0<< 2) |					//1->interrupt if right channel fifo is empty, 0->interrupt if right channel fifo is not full
				0x00;
	DAC1DFLT= 0xffff/2;						//default output
	DAC1RDAT = DAC1LDAT = DAC1DFLT;			//default output at the middle
	DAC1STATbits.LOEN = len?1:0;			//1->enable output, 0->disable output
	DAC1STATbits.ROEN = ren?1:0;			//1->enable output, 0->disable output
	DAC1CONbits.DACEN = 1;					//1->enable dac, 0->disable dac
}
//end dac1
#endif

//programmable crc
//initialize crc
void crcInit(uint16_t poly, uint8_t plen) {
	PMD3bits.CRCMD = 0;						//0->enable peripheral, 1->disable peripheral

	CRCCON = 0;								//default value

	CRCCONbits.PLEN = plen;					//poly length
	CRCXOR = poly;							//update the poly register
	//CRCCONbits.CRCGO= 1;					//start crc
}

//end programmable crc
